/*********************************************************************
* Copyright (C) 2000 by Progress Software Corporation ("PSC"),       *
* 14 Oak Park, Bedford, MA 01730, and other contributors as listed   *
* below.  All Rights Reserved.                                       *
*                                                                    *
* The Initial Developer of the Original Code is PSC.  The Original   *
* Code is Progress IDE code released to open source December 1, 2000.*
*                                                                    *
* The contents of this file are subject to the Possenet Public       *
* License Version 1.0 (the "License"); you may not use this file     *
* except in compliance with the License.  A copy of the License is   *
* available as of the date of this notice at                         *
* http://www.possenet.org/license.html                               *
*                                                                    *
* Software distributed under the License is distributed on an "AS IS"*
* basis, WITHOUT WARRANTY OF ANY KIND, either express or implied. You*
* should refer to the License for the specific language governing    *
* rights and limitations under the License.                          *
*                                                                    *
* Contributors:                                                      *
*                                                                    *
*********************************************************************/
/* t-a-eng.p - English language definitions for Admin module */

{ prores/t-define.i }

DEFINE INPUT PARAMETER qbf-s AS INTEGER NO-UNDO.

IF qbf-s < 0 THEN RETURN.
qbf-lang = "".

/*--------------------------------------------------------------------------*/
/*results.p,s-module.p*/
IF qbf-s = 1 THEN
  ASSIGN
    qbf-lang[ 1] = 'Q. Προβολές'
    qbf-lang[ 2] = 'R. Εκτυπώσεις'
    qbf-lang[ 3] = 'L. Ετικεττ/φος'
    qbf-lang[ 4] = 'D. Εξαγωγή'
    qbf-lang[ 5] = 'U. Χρήστης'
    qbf-lang[ 6] = 'A. Διαχείριση'
    qbf-lang[ 7] = 'E. Εξοδος'
    qbf-lang[ 8] = 'F. FAST TRACK'
    qbf-lang[10] = 'Το αρχείο' /*DBNAME.qc*/
    qbf-lang[11] = 'δεν βρέθηκε. Αυτό σημαίνει ότι θα πρέπει να κάνετε "Αρχική'
                 + ' Εγκατάσταση" της "database". Θέλετε να το κάνετε τώρα; '
    qbf-lang[12] = 'Επιλέξτε άλλη εργασία ή πατήστε [' + KBLABEL("END-ERROR")
                 + '] για να παραμείνετε εδώ.'
    qbf-lang[13] = 'Δεν έχετε αγοράσει το RESULTS.  Το Πρόγραμμα τελείωσε'
    qbf-lang[14] = 'Επιβεβαίωση εξόδου από "~{1~}"'
    qbf-lang[15] = 'ΜΗ-ΑΥΤΟΜ,ΗΜΙΑΥΤΟΜ,ΑΥΤΟΜΑΤΟ'
    qbf-lang[16] = 'Δεν υπάρχει σύνδεση με "database".'
    qbf-lang[17] = 'Αδύνατη η εκτέλεση όταν μία DB έχει εναλλακτική (logical) '
                 + 'ονομασία που αρχίζει από "QBF$".'
    qbf-lang[18] = 'Τέλος'
    qbf-lang[19] = '** Το RESULTS προβληματίζεται **^^Στον κατάλογο ~{1~}, '
                 + 'ούτε το ~{2~}.db ούτε το  ~{2~}.qc δεν βρέθηκαν. Το ~{3~}.qc'
                 + ' υπάρχει στο PROPATH, αλλά φαίνεται ότι ανήκει στο '
                 + '~{3~}.db. Παρακαλώ, διορθώστε το PROPATH ή μετονομάστε/διαγράψτε'
                 + ' το ~{3~}.db και .qc.'
    /* 24,26,30,32 available if necessary */
    qbf-lang[21] = '         Υπάρχουν τρείς τρόποι για να εγκαταστήσετε Φόρμες Προβολής για '
                 + 'PROGRESS'
    qbf-lang[22] = '         RESULTS.  Αφού το RESULTS έχει εγκαταστήσει τις '
                 + 'Φόρμες Προβολής,'
    qbf-lang[23] = '         μπορείτε να τις παραμετροποιήσετε, όποτε θέλετε.'
    qbf-lang[24] = 'Θέλετε να ορίσετε τις παραμέτρους εσείς, για τη κάθε' 
    qbf-lang[25] = 'Φόρμα Προβολής.'
    qbf-lang[27] = 'Εχοντας ορίσει εσείς ένα υποσύνολο εγγραφών από τα αρχεία'
    qbf-lang[28] = 'των συνδεδεμένων "database", το RESULTS δημιουργεί Φόρμες' 
    qbf-lang[29] = 'Προβολής μόνο για αυτά τα επιλεγμένα αρχεία.'
    qbf-lang[31] = 'Το RESULTS δημιουργεί όλες τις Φόρμες Προβολής αυτόματα.'.


/*--------------------------------------------------------------------------*/

ELSE

/*--------------------------------------------------------------------------*/
/*a-user.p*/
IF qbf-s = 2 THEN
  /* format x(72) for 1,2,9-14,19-22 */
  ASSIGN
    qbf-lang[ 1] = 'Δώστε την ονομασία του ενσωματωμένου αρχείου (Include) που θα'
    qbf-lang[ 2] = 'χρησιμοποιηθεί στην επιλογή "Ανεύρεση" κατά την εργασία Προβολής.'
    qbf-lang[ 3] = '   Προτεινόμενο Include:' /*format x(24)*/

    qbf-lang[ 8] = 'Το πρόγραμμα δεν βρέθηκε'

    qbf-lang[ 9] = 'Δώστε την ονομασία του προγράμματος εισαγωγής. Το πρόγραμμα '
                 + 'μπορεί να '
    qbf-lang[10] = 'είναι μία απλή οθόνη εισαγωγής ή πρόγραμμα εισόδου όπως '
                 + 'το login.p'
    qbf-lang[11] = 'που υπάρχει στον κατάλογο "DLC". Αυτό το πρόγραμμα εκτελείται '
                 + 'μόλις '
    qbf-lang[12] = 'διαβαστεί η γραμμή "signon=" από το αρχείο DBNAME.qc.'
    qbf-lang[13] = 'Δώστε την ονομασία του προϊόντος που θα εμφανίζεται '
    qbf-lang[14] = 'στο αρχικό μενού.'
    qbf-lang[15] = '    Πρόγραμμα Εισαγωγής:' /*format x(24)*/
    qbf-lang[16] = '     Ονομασία Προϊόντος:' /*format x(24)*/
    qbf-lang[17] = 'Προτεινόμενα :'

    qbf-lang[18] = 'PROGRESS Πρόγραμμα Χρήστη:'
    qbf-lang[19] = 'Το πρόγραμμα εκτελείται όποτε δίνεται την επιλογή "Χρήστης" '
                 + 'από μενού.'

    qbf-lang[20] = 'Εδώ, μπορείτε να καθορίσετε ένα πρόγραμμα εξαγωγής στοιχείων του '
    qbf-lang[21] = 'χρήστη. Παρακαλώ δώστε την ονομασία του προγράματος και τη περιγραφή'
    qbf-lang[22] = 'του για το μενού "Εξαγωγή στοιχείων - Ρυθμίσεις".'
    qbf-lang[23] = 'Πρόγραμμα:'
    qbf-lang[24] = 'Περιγραφή:'.

/*--------------------------------------------------------------------------*/

ELSE

/*--------------------------------------------------------------------------*/
/*a-load.p:*/
IF qbf-s = 3 THEN
  ASSIGN
    /* menu strip for d-main.p,l-main.p,r-main.p */
    qbf-lang[ 1] = 'Φόρτ.,Φόρτωση μίας ~{1~}.'
    qbf-lang[ 2] = 'Αποθ.,Αποθήκευση της τρέχουσας ~{1~}.'
    qbf-lang[ 3] = 'Εκτέλ.,Εκτέλεση της τρέχουσας ~{1~}.'
    qbf-lang[ 4] = 'Ορισ.,Επιλογή αρχείων και πεδίων.'
    qbf-lang[ 5] = 'Ρυθμ.,Αλλαγή τύπου, μορφής ή σχεδίασης της τρέχουσας ~{1~}.'
    qbf-lang[ 6] = 'Οπου,Επιλογή εγγραφών και ορισμός συνθηκών με το φίλτρο WHERE.'
    qbf-lang[ 7] = 'Ταξιν.,Αλλαγή της σειράς ταξινόμησης των εγγραφών.'
    qbf-lang[ 8] = 'Ακύρ.,Ακύρωση της τρέχουσας ~{1~}.'
    qbf-lang[ 9] = 'Πληρ.,Πληροφορίες για τις τρέχουσας ρυθμίσεις.'
    qbf-lang[10] = 'Εργ.,Επιλογή άλλης εργασίας.'
    qbf-lang[11] = 'Χρήσ.,Εκτέλεση προγράμματος που ορίζεται από τον χρήστη.'
    qbf-lang[12] = 'Τέλος,Τέλος.'
    qbf-lang[13] = '' /* terminator */
    qbf-lang[14] = 'εξαγωγής,ετικέττας,εκτύπωσης'

    qbf-lang[15] = 'Ανάγνωση του αρχείου Παραμέτρων Συστήματος...'

    /* system values for CONTINUE Must be <= 12 characters */
    qbf-lang[18] = '  Συνέχεια' /* for error dialog box */
    qbf-lang[19] = 'Ελληνικά (928)' /* this name of this language */
    /* word "of" for "xxx of yyy" on scrolling lists */
    qbf-lang[20] = 'από'
    /* standard product name */
    qbf-lang[22] = 'PROGRESS RESULTS'
    /* system values for descriptions of calc fields */
    qbf-lang[23] = ',Τρέχον Σύνολο,Ποσοστό του Συνόλου,Μετρητής,Πράξη με Αλφαριθμητικά,'
                 + 'Πράξη με Ημερομηνίες,Πράξη με Αριθμητικά,Λογικές Πράξεις,Κατακόρυφος Πίνακας'
    /* system values for YES and NO.  Must be <= 8 characters each */
    qbf-lang[24] = '  Ναι  ,  Οχι  ' /* for yes/no dialog box */

    qbf-lang[25] = 'Εγινε διακοπή κατά την Αυτόματη Εγκατάσταση.  '
                 + 'Να συνεχίσει η Αυτόματη Εγκατάσταση; '

    qbf-lang[26] = '* ΠΡΟΣΟΧΗ - Διαφορετικές εκδόσεις *^^Η τρέχουσα έκδοση είναι '
                 + '<~{1~}> ενώ η έκδοση στο αρχείο .qc είναι <~{2~}>.  Μπορεί '
                 + 'να υπάρχουν προβλήματα ώσπου να ξαναδημιουργήσετε τις Φόρμες '
                 + 'Προβολής με την επιλογή "Επανεγκατάσταση Εφαρμογής".'

    qbf-lang[27] = '* ΠΡΟΣΟΧΗ - Λείπουν "Database" *^^Οι εξής "database" '
                 + 'χρειάζονται αλλά δεν έχουν συνδεθεί :'

    qbf-lang[32] = '* ΠΡΟΣΟΧΗ - Η δομή της DB έχει αλλάξει *^^Η δόμη άλλαξε '
                 + 'αφού εγκαταστάθηκαν Φόρμες Προβολής.  '
                 + 'Παρακαλώ χρησιμοποιήστε την επιλογή "Επανεγκατάσταση Εφαρμογής" '
                 + 'από το μενού διαχείρισης συστήματος.'.

/*--------------------------------------------------------------------------*/

ELSE

/*--------------------------------------------------------------------------*/
/* a-main.p */
IF qbf-s = 4 THEN
  ASSIGN
    qbf-lang[ 1] = " A. Επανεγκατάσταση Εφαρμογής"
    qbf-lang[ 2] = " F. Ορισμοί Φορμών για Προβολές"
    qbf-lang[ 3] = " R. Σχέσεις Μεταξύ Αρχείων"

    qbf-lang[ 4] = " C. Περιεχόμενα Καταλόγου Χρήστη"
    qbf-lang[ 5] = " H. Τρόπος Εξόδου από Εφαρμογή"
    qbf-lang[ 6] = " M. Προσβάσεις Εργασιών"
    qbf-lang[ 7] = " Q. Προσβάσεις Προβολών"
    qbf-lang[ 8] = " S. Πρόγραμμα Εισαγωγής/Προϊόν"

    qbf-lang[11] = " G. Γλώσσα"
    qbf-lang[12] = " P. Ορισμός Εκτυπωτών"
    qbf-lang[13] = " T. Χρώματα Οθόνης Τερματικού"

    qbf-lang[14] = " B. Πρόγραμμα Ανεύρεσης(Προβολές)"
    qbf-lang[15] = " D. Παράμετροι Εκτυπώσεων"
    qbf-lang[16] = " E. Πρόγραμμα Εξαγωγής Στοιχείων"
    qbf-lang[17] = " L. Επιλογή Πεδίων για Ετικέττες"
    qbf-lang[18] = " U. Ορισμός Προγράμματος Χρήστη"

    qbf-lang[21] = 'Επιλέξτε εργασία ή [' + KBLABEL("END-ERROR")
                 + '] για τέλος και αποθήκευση μεταβολών.'
    /* these next four have a length limit of 20 including colon */
    qbf-lang[22] = 'Αρχεία:'
    qbf-lang[23] = 'Παράμετροι:'
    qbf-lang[24] = 'Ασφάλεια:'
    qbf-lang[25] = 'Εργασίες:'

    qbf-lang[26] = 'Διαχείριση Συστήματος'
    qbf-lang[27] = 'Εκδοση'
    qbf-lang[28] = 'Φόρτωση των επιπλέον παραμέτρων διαχείρισης από '
                 + 'το αρχείο Παραμέτρων.'
    qbf-lang[29] = 'Επιβεβαίωση για την επανεγκατάσταση της εφαρμογής'
/* QUIT and RETURN are the PROGRESS keywords and cannot be translated */
    qbf-lang[30] = 'Οταν ο χρήστης επιλέγει "Τέλος" από το αρχικό μενού, '
                 + 'τι θέλετε να κάνει το πρόγραμμα ; "Quit" ή "Return"'
    qbf-lang[31] = 'Επιβεβαίωση εξόδου από το μένου '  
                 + 'Διαχείρισης Συστήματος'
    qbf-lang[32] = 'Ελεγχος της δομής του αρχείου Παραμέτρων και αποθήκευση '
                 + 'των μεταβολών.'.

/*--------------------------------------------------------------------------*/

ELSE

/*--------------------------------------------------------------------------*/
IF qbf-s = 5 THEN
  ASSIGN
/*a-perm.p, 1..7 also used by a-form.p and a-print.p*/
    qbf-lang[ 1] = 'Προσβάσεις'
    qbf-lang[ 2] = ' *                         - Ολοι οι χρήστες έχουν πρόσβαση.'
    qbf-lang[ 3] = ' <χρήστης>,<χρήστης>,κοκ.  - Μόνο αυτοί οι χρήστες έχουν πρόσβαση.'
    qbf-lang[ 4] = ' !<χρήστης>,!<χρήστης>,*   - Ολοι εκτός των χρηστών αυτών έχουν '
                 + 'πρόσβαση.'
    qbf-lang[ 5] = ' acct*                     - Μόνο χρήστες που αρχίζουν "acct" '
                 + 'έχουν πρόσβαση.'
    qbf-lang[ 6] = 'Δώστε τους χρήστες κατά όνομα εισαγωγής (Login ID), χωρισμένα με '
                 + 'κόμματα.'
    qbf-lang[ 7] = 'Τα ονόματα μπορούν να περιέχουν χαρακτήρες "μπαλαντέρ". Το θαυμαστικό '
                 + 'αποκλεί.'
                   /* from 8 thru 13, format x(30) */
    qbf-lang[ 8] = 'Επιλέξτε μία εργασία από τη'
    qbf-lang[ 9] = 'λίστα αριστερά για να δηλώσετε'
    qbf-lang[10] = 'τα ονόματα χρηστών με πρόσβαση.'
    qbf-lang[11] = 'Επιλέξτε μία λειτουργία από τη '
    qbf-lang[12] = 'λίστα αριστερά για να δηλώσετε '
    qbf-lang[13] = 'τα ονόματα χρηστών με πρόσβαση.'
    qbf-lang[14] = 'Πατήστε [' + KBLABEL("END-ERROR")
                 + '] αφού κάνετε τις μεταβολές.'
    qbf-lang[15] = 'Πατήστε [' + KBLABEL("GO") + '] για αποθήκευση, ['
                 + KBLABEL("END-ERROR") + '] για ανάκληση.'
    qbf-lang[16] = 'Δεν μπορείτε να αποκλείσετε τον εαυτό σας από τη Διαχείριση του Συστήματος !'
/*a-print.p:*/     /*21 thru 26 must be format x(16) and right-justified */
    qbf-lang[21] = 'Επαναφορά(Reset)'
    qbf-lang[22] = '                '
    qbf-lang[23] = '        Κανονική'
    qbf-lang[24] = '    Συνεπτυγμένη'  
    qbf-lang[25] = '          Εντονη'
    qbf-lang[26] = ' Ακύρωση Εντονης'.

/*--------------------------------------------------------------------------*/

ELSE

/*--------------------------------------------------------------------------*/
IF qbf-s = 6 THEN
  ASSIGN
/*a-write.p:*/
    qbf-lang[ 1] = 'Φόρτωση παραμέτρων εργασίας'
    qbf-lang[ 2] = 'Φόρτωση παραμέτρων χρωμάτων οθόνης'
    qbf-lang[ 3] = 'Φόρτωση ρυθμίσεων εκτυπωτή'
    qbf-lang[ 4] = 'Φόρτωση λίστας αρχείων για προβολές'
    qbf-lang[ 5] = 'Φόρτωση λίστας σχέσεων μεταξύ αρχείων'
    qbf-lang[ 6] = 'Φόρτωση λίστας αυτόματης επιλογής πεδίων για ετικέττες'
    qbf-lang[ 7] = 'Φόρτωση λίστας προσβάσεων για επιλογές προβολής'
    qbf-lang[ 8] = 'Φόρτωση στοιχείων του προγράμματος του χρήστη'
    qbf-lang[ 9] = 'Φόρτωση προτεινόμενων παραμέτρων εκτυπώσεων του συστήματος'

/* a-color.p*/
                 /* 12345678901234567890123456789012 */
    qbf-lang[11] = '    Χρώματα για τύπο τερματικού:' /* must be 32 */
                 /* 1234567890123456789012345 */
    qbf-lang[12] = 'Μενού:          Κανονικά:' /* must be 25 */
    qbf-lang[13] = '           Φωτεινή μπάρα:'
    qbf-lang[14] = 'Παράθ.Διαλόγου: Κανονικά:'
    qbf-lang[15] = '           Φωτεινή μπάρα:'
    qbf-lang[16] = 'Λίστα επιλογών: Κανονικά:'
    qbf-lang[17] = '           Φωτεινή μπάρα:'

/*a-field.p*/    /*"----- ----- ----- ----- ----"*/
    qbf-lang[30] = 'Εμφάν Μεταβ Αναζ. Ανεύρ Σειρ'
    qbf-lang[31] = 'Οι Αποδεκτές τιμές είναι από 1 έως 9999.'
    qbf-lang[32] = 'Θέλετε να αποθηκεύσετε τις μεταβολές που κάνετε στή '
                 + 'λίστα πεδίων; '.

/*--------------------------------------------------------------------------*/

ELSE

/*--------------------------------------------------------------------------*/
IF qbf-s = 8 THEN
/*a-label.p*/
  ASSIGN            /* 1..8 use format x(78) */
                    /* 1 and 8 are available for more explanation, in */
                    /*   case the translation won't fit in 2 thru 7.  */
    qbf-lang[ 1] = 'Δώστε τις ονομασίες πεδίων που περιέχουν τα στοιχεία της '
                 + 'διεύθυνσης. '
    qbf-lang[ 2] = 'Χρησιμοποιήστε σύνταξη μορφής CAN-DO σαν μάσκα για να '
                 + 'βρείτε τα πεδία ("*" '
    qbf-lang[ 3] = 'αντιστοιχεί με έναν ή παραπάνω χαρακτήρες, "." αντιστοιχεί '
                 + 'με έναν χαρακτήρα).'
    qbf-lang[ 4] = 'Αυτά τα στοιχεία χρησιμοποιούνται στην δημιουργία των '
                 + 'προτεινόμενων ετικεττών.'
    qbf-lang[ 5] = 'Να έχετε υπ''όψιν ότι μερικές καταχωρήσεις μπορεί να περισσεύουν '
                 + 'δηλαδή, αν '
    qbf-lang[ 6] = 'χρησιμοποιήσετε Πόλη, Νομό και Τ.Κ. σαν ξεχωριστά πεδία τότε, '
                 + 'η γραμμή "Π-Ν-Τ "'
    qbf-lang[ 7] = 'πλεονάζει.'
                  /* each entry in list must be <= 5 characters long */
                  /* but may be any portion of address that is applicable */
                  /* in the target country */
    qbf-lang[ 9] = 'Ονομα,Υπόψη,Διεύ1,Διεύ2,Διεύ3,Τ.Κ.,Πόλη,Τ-Π,Νομός,Χώρα'
    qbf-lang[10] = 'Το Πεδίο που περιέχει την Επωνυμία/Ονομα <Ονομα>'
    qbf-lang[11] = 'Το Πεδίο που περιέχει το όνομα του υπεύθυνου <Υπόψη>'
    qbf-lang[12] = 'Το Πεδίο που περιέχει την <πρώτη> γραμμή της διεύθυνσης (π.χ. οδός)'
    qbf-lang[13] = 'Το Πεδίο που περιέχει <δεύτερη> γραμμή της διεύθυνσης (π.χ. Τάχ.Θυρίδα)'
    qbf-lang[14] = 'Το Πεδίο που περιέχει <τρίτη> γραμμή της διεύθυνσης (προαιρετικό)'
    qbf-lang[15] = 'Το Πεδίο που περιέχει τον Ταχυδρομικό Κώδικα <Τ.Κ.>'
    qbf-lang[16] = 'Το Πεδίο που περιέχει την <Πόλη>'
    qbf-lang[17] = 'Το Πεδίο που περιέχει <Τ.Κ.- Πόλη> σε μία γραμμή'
    qbf-lang[18] = 'Το Πεδίο που περιέχει τον νομό <Νομός>'
    qbf-lang[19] = 'Το Πεδίο που περιέχει τη χώρα <Χώρα>'

/*a-join.p*/
    qbf-lang[23] = 'Δεν επιτρέπεται η "αυτό-ένωση" του αρχείου αυτή τη στιγμή.'
    qbf-lang[24] = 'Εχετε φτάσει στο όριο για ενωτικές σχέσεις μεταξύ αρχείων.'
    qbf-lang[25] = 'Ενώση του' /* 25 and 26 are automatically */
    qbf-lang[26] = 'με το'          /*   right-justified           */
    qbf-lang[27] = 'Δώστε το φίλτρο WHERE ή OF : (αφήστέ το κενό για ακύρωση της ένωσης)'
    qbf-lang[28] = 'Πατήστε [' + KBLABEL("END-ERROR") + '] αφού κάνετε τις μεταβολές.'
    qbf-lang[30] = 'Η συνθήκη πρέπει να αρχίσει με WHERE ή OF.'
    qbf-lang[31] = 'Δώστε την ονομασία του πρώτου αρχείου της ένωσης για προσθήκη ή ακύρωση.'
    qbf-lang[32] = 'Τώρα, δώστε την ονομασία του δεύτερου αρχείου της ένωσης.'.

/*--------------------------------------------------------------------------*/

ELSE

/*--------------------------------------------------------------------------*/
/* a-form.p */
IF qbf-s = 9 THEN
  ASSIGN           /* 1..6 format x(45) */
    qbf-lang[ 1] = ' A. Προσθήκη Νέας Φόρμας Προβολής'
    qbf-lang[ 2] = ' C. Επιλογή Φόρμας Προβολής για Μεταβολή '
    qbf-lang[ 3] = ' G. Γενικά Χαρακτηριστικά της Φόρμας'
    qbf-lang[ 4] = ' W. Επιλογή Πεδίων για τη Φόρμα'
    qbf-lang[ 5] = ' P. Προσβάσεις '
    qbf-lang[ 6] = ' D. Διαγραφή της Τρέχουσας Φόρμας'
    qbf-lang[ 7] = ' Επιλογή :' /* format x(10) */
    qbf-lang[ 8] = ' Μεταβολή:' /* format x(10) */
                 /* cannot changed width of 9..16 from defined below */
    qbf-lang[ 9] = '    Ονομάσια αρχείου DB' /* right-justify 9..14 */
    qbf-lang[10] = '           Τύπος Φόρμας'
    qbf-lang[11] = '     Πρόγραμμα Προβολής'
    qbf-lang[12] = 'Ονομασία Αρχείου Φόρμας'
    qbf-lang[13] = ' Ονομασία Frame για 4GL'
    qbf-lang[14] = '              Περιγραφή'
    qbf-lang[15] = '(Θεωρείται .p)' /* left-justify 15 and 16 */
    qbf-lang[16] = '(Δώστε extension)'
    qbf-lang[18] = 'H Φόρμα έχει ~{1~} γραμμές. Επειδή το RESULTS δεσμεύει '
                 + 'πέντε γραμμές για χρήση του ιδίου, ξεπερνά το όριο γραμμών '
                 + 'οθόνης σε τερματικό 24x80. Θέλετε να ορίσετε μια φόρμα με '
                 + 'αυτό το μέγεθος; '
    qbf-lang[19] = 'Ηδη υπαρχεί ένα πρόγραμμα προβολής μ''αυτή την ονομασία.'
    qbf-lang[20] = 'Η Φόρμα πρέπει να υπάρχει ήδη ή να έχει την κατάληξη .f αν '
                 + 'πρόκειται για Αυτόματη Δημιουργία.'
    qbf-lang[21] = 'Η ονομασία του "Frame" για τον κώδικα 4GL που δώσατε '
                 + 'είναι δεσμευμένη. Δώστε διαφορετική ονομασία.'
    qbf-lang[22] = ' Επιλογή Αρχείων '
    qbf-lang[23] = 'Πατήστε [' + KBLABEL("END-ERROR") + '] αφού κάνετε τις μεταβολές'
    qbf-lang[24] = 'Αποθήκευση στοιχείων της Φόρμας στη Βιβλιοθήκη Φορμών...'
    qbf-lang[25] = 'Εχετε μεταβάλει τουλάχιστον μία Φορμα Προβολής. Μπορείτε να '
                 + 'κάνετε, είτε "compile" της Φόρμας τώρα, είτε "Επανεγκατάσταση '
                 + 'Εφαρμογής" μετά.  Θέλετε "Compile" τώρα; '
    qbf-lang[26] = 'Δεν βρέθηκε φόρμα με την ονόμασια "~{1~}".'
                 + 'Θέλετε να τη δημιουρήσετε; '
    qbf-lang[27] = 'Υπάρχει Φόρμα Προβολής με την ονομασία "~{1~}".'
                 + 'Θέλετε να χρησιμοποιήσετε τα πεδία που ανήκουν σ''αυτή τη Φόρμα; '
    qbf-lang[28] = 'Επιβεβαίωση διαγραφής της Φόρμας Προβολής'
    qbf-lang[29] = '** To Πρόγραμμα Προβολής - "~{1~}" διαγράφηκε. **'
    qbf-lang[30] = 'Δημιουργία της Φόρμας Προβολής...'
    qbf-lang[31] = 'Εχετε φτάσει στο όριο αποθήκευσης για Φόρμες Προβολής.'
    qbf-lang[32] = 'Αδύνατη η εγκατάσταση της Φόρμας Προβολής γι''άυτο το αρχείο.^^Για να '
                 + 'εγκατασταθεί ή φόρμα, είτε η "Γέφυρα" πρέπει να υποστηρίζει "RECIDs", '
                 + 'είτε να υπάρχει μοναδικό κλειδί (unique index) για το αρχείο.'.

/*--------------------------------------------------------------------------*/

ELSE

/*--------------------------------------------------------------------------*/
/* a-print.p */
IF qbf-s = 10 THEN
  ASSIGN           /* 1..6 format x(45) */
    qbf-lang[ 1] = ' A. Προσθήκη Νέας Μονάδας Εξόδου '
    qbf-lang[ 2] = ' C. Επιλογή Μονάδας για Μεταβολή '
    qbf-lang[ 3] = ' G. Γενικά Χαρακτηριστικά της Μονάδας '
    qbf-lang[ 4] = ' S. Χαρακτήρες Ελέγχου '
    qbf-lang[ 5] = ' P. Προσβάσεις Εκτυπωτών '
    qbf-lang[ 6] = ' D. Διαγραφή της Τρέχουσας Μονάδας '
    qbf-lang[ 7] = ' Επιλογή: ' /* format x(10) */
    qbf-lang[ 8] = ' Μεταβολή:' /* format x(10) */
    qbf-lang[ 9] = 'Οι Αποδεκτές τιμές είναι από 1 έως 255.'
    qbf-lang[10] = 'O Τύπος πρέπει να είναι term, thru, to, view, file, page ή prog'
    qbf-lang[11] = 'Εχετε φτάσει στο όριο για Μονάδες Εξόδου.'
    qbf-lang[12] = 'Μόνο Ο Τύπος Μονάδας "term" μπόρει να έχει έξοδο σε TERMINAL.'
    qbf-lang[13] = 'Δεν βρέθηκε η ονομασία προγράμματος με το τρέχον PROPATH.'
                  /*17 thru 20 must be format x(16) and right-justified */
    qbf-lang[17] = 'Περιγραφή λίστας'
    qbf-lang[18] = 'Οναμασία Μονάδας'
    qbf-lang[19] = '   Μέγιστο Εύρος'
    qbf-lang[20] = '           Τύπος'
    qbf-lang[21] = 'Βλέπε παρακάτω'
    qbf-lang[22] = 'TERMINAL, όπως OUTPUT TO TERMINAL PAGED'
    qbf-lang[23] = 'TO πρός μονάδα, όπως OUTPUT TO PRINTER'
    qbf-lang[24] = 'THROUGH μέσω spooler ή φίλτρο UNIX ή OS/2'
    qbf-lang[25] = 'Στέλνει την εκτύπωση σε αρχείο, και μετά εκτελεί αυτό το πρόγραμμα'
    qbf-lang[26] = 'Ζητά την ονομασία του αρχείου εξόδου από τον χρήστη'
    qbf-lang[27] = 'Αλλαγή σελίδας με προηγούμενη/επόμενη οθόνη (prev-page και next-page)'
    qbf-lang[28] = 'Κλήση προγράμματος 4GL για την αρχή/τέλος της ροής εξόδου'
    qbf-lang[30] = 'Πατήστε [' + KBLABEL("END-ERROR") + '] αφού κάνετε τις μεταβολές'
    qbf-lang[31] = 'Πρέπει να υπάρχει τουλάχιστον μία Μονάδα Εξόδου !'
    qbf-lang[32] = 'Επιβεβαίωση διαγραφής του εκτυπωτή'.

/*--------------------------------------------------------------------------*/

RETURN.
