/*********************************************************************
* Copyright (C) 2000 by Progress Software Corporation ("PSC"),       *
* 14 Oak Park, Bedford, MA 01730, and other contributors as listed   *
* below.  All Rights Reserved.                                       *
*                                                                    *
* The Initial Developer of the Original Code is PSC.  The Original   *
* Code is Progress IDE code released to open source December 1, 2000.*
*                                                                    *
* The contents of this file are subject to the Possenet Public       *
* License Version 1.0 (the "License"); you may not use this file     *
* except in compliance with the License.  A copy of the License is   *
* available as of the date of this notice at                         *
* http://www.possenet.org/license.html                               *
*                                                                    *
* Software distributed under the License is distributed on an "AS IS"*
* basis, WITHOUT WARRANTY OF ANY KIND, either express or implied. You*
* should refer to the License for the specific language governing    *
* rights and limitations under the License.                          *
*                                                                    *
* Contributors:                                                      *
*                                                                    *
*********************************************************************/
/* t-a-eng.p - English language definitions for Admin module */

{ prores/t-define.i }

DEFINE INPUT PARAMETER qbf-s AS INTEGER NO-UNDO.

IF qbf-s < 0 THEN RETURN.
qbf-lang = "".

/*--------------------------------------------------------------------------*/
/*results.p,s-module.p*/
IF qbf-s = 1 THEN
  ASSIGN
    qbf-lang[ 1] = 'Q. ПижЩжвтк'
    qbf-lang[ 2] = 'R. ДблмзщйЬак'
    qbf-lang[ 3] = 'L. ДлабЬлл/нжк'
    qbf-lang[ 4] = 'D. ДеШЪрЪу'
    qbf-lang[ 5] = 'U. ХиуйлЮк'
    qbf-lang[ 6] = 'A. ГаШоЬхиайЮ'
    qbf-lang[ 7] = 'E. ДежЫжк'
    qbf-lang[ 8] = 'F. FAST TRACK'
    qbf-lang[10] = 'Тж ШиоЬхж' /*DBNAME.qc*/
    qbf-lang[11] = 'ЫЬд ЩитЯЮбЬ. Амлц йЮгШхдЬа цла ЯШ зитзЬа дШ бсдЬлЬ "Аиоабу'
                 + ' ДЪбШлсйлШйЮ" лЮк "database". ЗтвЬлЬ дШ лж бсдЬлЬ лщиШ; '
    qbf-lang[12] = 'ДзавтелЬ сввЮ ЬиЪШйхШ у зШлуйлЬ [' + KBLABEL("END-ERROR")
                 + '] ЪаШ дШ зШиШгЬхдЬлЬ ЬЫщ.'
    qbf-lang[13] = 'ГЬд тоЬлЬ ШЪжисйЬа лж RESULTS.  Тж ПицЪиШггШ лЬвЬхрйЬ'
    qbf-lang[14] = 'ДзаЩЬЩШхрйЮ ЬецЫжм Шзц "~{1~}"'
    qbf-lang[15] = 'ЛЖ-АУТОЛ,ЖЛИАУТОЛ,АУТОЛАТО'
    qbf-lang[16] = 'ГЬд мзсиоЬа йчдЫЬйЮ гЬ "database".'
    qbf-lang[17] = 'АЫчдШлЮ Ю ЬблтвЬйЮ цлШд гхШ DB тоЬа ЬдШввШблабу (logical) '
                 + 'жджгШйхШ зжм ШиохЭЬа Шзц "QBF$".'
    qbf-lang[18] = 'Ттвжк'
    qbf-lang[19] = '** Тж RESULTS зижЩвЮгШлхЭЬлШа **^^Слжд бШлсвжЪж ~{1~}, '
                 + 'жчлЬ лж ~{2~}.db жчлЬ лж  ~{2~}.qc ЫЬд ЩитЯЮбШд. Тж ~{3~}.qc'
                 + ' мзсиоЬа йлж PROPATH, Шввс нШхдЬлШа цла ШдубЬа йлж '
                 + '~{3~}.db. ПШиШбШвщ, ЫажиЯщйлЬ лж PROPATH у гЬлжджгсйлЬ/ЫаШЪисплЬ'
                 + ' лж ~{3~}.db бШа .qc.'
    /* 24,26,30,32 available if necessary */
    qbf-lang[21] = '         Узсиожмд лиЬхк лицзжа ЪаШ дШ ЬЪбШлШйлуйЬлЬ ФцигЬк ПижЩжвук ЪаШ '
                 + 'PROGRESS'
    qbf-lang[22] = '         RESULTS.  Анжч лж RESULTS тоЬа ЬЪбШлШйлуйЬа лак '
                 + 'ФцигЬк ПижЩжвук,'
    qbf-lang[23] = '         гзжиЬхлЬ дШ лак зШиШгЬлижзжауйЬлЬ, цзжлЬ ЯтвЬлЬ.'
    qbf-lang[24] = 'ЗтвЬлЬ дШ жихйЬлЬ лак зШиШгтлижмк ЬйЬхк, ЪаШ лЮ бсЯЬ' 
    qbf-lang[25] = 'ФцигШ ПижЩжвук.'
    qbf-lang[27] = 'ДождлШк жихйЬа ЬйЬхк тдШ мзжйчджвж ЬЪЪиШнщд Шзц лШ ШиоЬхШ'
    qbf-lang[28] = 'лрд ймдЫЬЫЬгтдрд "database", лж RESULTS ЫЮгажмиЪЬх ФцигЬк' 
    qbf-lang[29] = 'ПижЩжвук гцдж ЪаШ Шмлс лШ ЬзавЬЪгтдШ ШиоЬхШ.'
    qbf-lang[31] = 'Тж RESULTS ЫЮгажмиЪЬх цвЬк лак ФцигЬк ПижЩжвук ШмлцгШлШ.'.


/*--------------------------------------------------------------------------*/

ELSE

/*--------------------------------------------------------------------------*/
/*a-user.p*/
IF qbf-s = 2 THEN
  /* format x(72) for 1,2,9-14,19-22 */
  ASSIGN
    qbf-lang[ 1] = 'ГщйлЬ лЮд жджгШйхШ лжм ЬдйргШлргтджм ШиоЬхжм (Include) зжм ЯШ'
    qbf-lang[ 2] = 'оиЮйагжзжаЮЯЬх йлЮд ЬзавжЪу "АдЬчиЬйЮ" бШлс лЮд ЬиЪШйхШ ПижЩжвук.'
    qbf-lang[ 3] = '   ПижлЬадцгЬдж Include:' /*format x(24)*/

    qbf-lang[ 8] = 'Тж зицЪиШггШ ЫЬд ЩитЯЮбЬ'

    qbf-lang[ 9] = 'ГщйлЬ лЮд жджгШйхШ лжм зижЪисггШлжк ЬайШЪрЪук. Тж зицЪиШггШ '
                 + 'гзжиЬх дШ '
    qbf-lang[10] = 'ЬхдШа гхШ Шзву жЯцдЮ ЬайШЪрЪук у зицЪиШггШ ЬайцЫжм цзрк '
                 + 'лж login.p'
    qbf-lang[11] = 'зжм мзсиоЬа йлжд бШлсвжЪж "DLC". Амлц лж зицЪиШггШ ЬблЬвЬхлШа '
                 + 'гцвак '
    qbf-lang[12] = 'ЫаШЩШйлЬх Ю ЪиШггу "signon=" Шзц лж ШиоЬхж DBNAME.qc.'
    qbf-lang[13] = 'ГщйлЬ лЮд жджгШйхШ лжм зижфцдлжк зжм ЯШ ЬгнШдхЭЬлШа '
    qbf-lang[14] = 'йлж Шиоабц гЬджч.'
    qbf-lang[15] = '    ПицЪиШггШ ДайШЪрЪук:' /*format x(24)*/
    qbf-lang[16] = '     ОджгШйхШ Пижфцдлжк:' /*format x(24)*/
    qbf-lang[17] = 'ПижлЬадцгЬдШ :'

    qbf-lang[18] = 'PROGRESS ПицЪиШггШ ХиуйлЮ:'
    qbf-lang[19] = 'Тж зицЪиШггШ ЬблЬвЬхлШа цзжлЬ ЫхдЬлШа лЮд ЬзавжЪу "ХиуйлЮк" '
                 + 'Шзц гЬджч.'

    qbf-lang[20] = 'ДЫщ, гзжиЬхлЬ дШ бШЯжихйЬлЬ тдШ зицЪиШггШ ЬеШЪрЪук йлжаоЬхрд лжм '
    qbf-lang[21] = 'оиуйлЮ. ПШиШбШвщ ЫщйлЬ лЮд жджгШйхШ лжм зижЪисгШлжк бШа лЮ зЬиаЪиШну'
    qbf-lang[22] = 'лжм ЪаШ лж гЬджч "ДеШЪрЪу йлжаоЬхрд - РмЯгхйЬак".'
    qbf-lang[23] = 'ПицЪиШггШ:'
    qbf-lang[24] = 'ПЬиаЪиШну:'.

/*--------------------------------------------------------------------------*/

ELSE

/*--------------------------------------------------------------------------*/
/*a-load.p:*/
IF qbf-s = 3 THEN
  ASSIGN
    /* menu strip for d-main.p,l-main.p,r-main.p */
    qbf-lang[ 1] = 'Фцил.,ФцилрйЮ гхШк ~{1~}.'
    qbf-lang[ 2] = 'АзжЯ.,АзжЯубЬмйЮ лЮк литожмйШк ~{1~}.'
    qbf-lang[ 3] = 'Дблтв.,ДблтвЬйЮ лЮк литожмйШк ~{1~}.'
    qbf-lang[ 4] = 'Оиай.,ДзавжЪу ШиоЬхрд бШа зЬЫхрд.'
    qbf-lang[ 5] = 'РмЯг.,АввШЪу лчзжм, гжинук у йоЬЫхШйЮк лЮк литожмйШк ~{1~}.'
    qbf-lang[ 6] = 'Озжм,ДзавжЪу ЬЪЪиШнщд бШа жиайгцк ймдЯЮбщд гЬ лж нхвлиж WHERE.'
    qbf-lang[ 7] = 'ТШеад.,АввШЪу лЮк йЬаиск лШеадцгЮйЮк лрд ЬЪЪиШнщд.'
    qbf-lang[ 8] = 'Абчи.,АбчирйЮ лЮк литожмйШк ~{1~}.'
    qbf-lang[ 9] = 'ПвЮи.,ПвЮижнжихЬк ЪаШ лак литожмйШк имЯгхйЬак.'
    qbf-lang[10] = 'ДиЪ.,ДзавжЪу сввЮк ЬиЪШйхШк.'
    qbf-lang[11] = 'Хиуй.,ДблтвЬйЮ зижЪисггШлжк зжм жихЭЬлШа Шзц лжд оиуйлЮ.'
    qbf-lang[12] = 'Ттвжк,Ттвжк.'
    qbf-lang[13] = '' /* terminator */
    qbf-lang[14] = 'ЬеШЪрЪук,ЬлабтллШк,ЬблчзрйЮк'

    qbf-lang[15] = 'АдсЪдрйЮ лжм ШиоЬхжм ПШиШгтлирд СмйлугШлжк...'

    /* system values for CONTINUE Must be <= 12 characters */
    qbf-lang[18] = '  СмдтоЬаШ' /* for error dialog box */
    qbf-lang[19] = 'ДввЮдабс (437)' /* this name of this language */
    /* word "of" for "xxx of yyy" on scrolling lists */
    qbf-lang[20] = 'Шзц'
    /* standard product name */
    qbf-lang[22] = 'PROGRESS RESULTS'
    /* system values for descriptions of calc fields */
    qbf-lang[23] = ',Титожд Счджвж,Пжйжйлц лжм Смдцвжм,ЛЬлиЮлук,ПисеЮ гЬ АвнШиаЯгЮлабс,'
                 + 'ПисеЮ гЬ ЖгЬижгЮдхЬк,ПисеЮ гЬ АиаЯгЮлабс,КжЪабтк ПисеЬак,ЙШлШбцимнжк ПхдШбШк'
    /* system values for YES and NO.  Must be <= 8 characters each */
    qbf-lang[24] = '  МШа  ,  Ооа  ' /* for yes/no dialog box */

    qbf-lang[25] = 'ДЪадЬ ЫаШбжзу бШлс лЮд АмлцгШлЮ ДЪбШлсйлШйЮ.  '
                 + 'МШ ймдЬохйЬа Ю АмлцгШлЮ ДЪбШлсйлШйЮ; '

    qbf-lang[26] = '* ПРОСОХЖ - ГаШнжиЬлабтк ЬбЫцйЬак *^^Ж литожмйШ тбЫжйЮ ЬхдШа '
                 + '<~{1~}> Ьдщ Ю тбЫжйЮ йлж ШиоЬхж .qc ЬхдШа <~{2~}>.  ЛзжиЬх '
                 + 'дШ мзсиожмд зижЩвугШлШ щйзжм дШ еШдШЫЮгажмиЪуйЬлЬ лак ФцигЬк '
                 + 'ПижЩжвук гЬ лЮд ЬзавжЪу "ДзШдЬЪбШлсйлШйЮ ДнШигжЪук".'

    qbf-lang[27] = '* ПРОСОХЖ - КЬхзжмд "Database" *^^Оа Ьеук "database" '
                 + 'оиЬасЭждлШа Шввс ЫЬд тожмд ймдЫЬЯЬх :'

    qbf-lang[32] = '* ПРОСОХЖ - Ж Ыжгу лЮк DB тоЬа ШввсеЬа *^^Ж ЫцгЮ сввШеЬ '
                 + 'Шнжч ЬЪбШлШйлсЯЮбШд ФцигЬк ПижЩжвук.  '
                 + 'ПШиШбШвщ оиЮйагжзжауйлЬ лЮд ЬзавжЪу "ДзШдЬЪбШлсйлШйЮ ДнШигжЪук" '
                 + 'Шзц лж гЬджч ЫаШоЬхиайЮк ймйлугШлжк.'.

/*--------------------------------------------------------------------------*/

ELSE

/*--------------------------------------------------------------------------*/
/* a-main.p */
IF qbf-s = 4 THEN
  ASSIGN
    qbf-lang[ 1] = " A. ДзШдЬЪбШлсйлШйЮ ДнШигжЪук"
    qbf-lang[ 2] = " F. Оиайгжх Фжигщд ЪаШ ПижЩжвтк"
    qbf-lang[ 3] = " R. СотйЬак ЛЬлШеч АиоЬхрд"

    qbf-lang[ 4] = " C. ПЬиаЬоцгЬдШ ЙШлШвцЪжм ХиуйлЮ"
    qbf-lang[ 5] = " H. Тицзжк ДецЫжм Шзц ДнШигжЪу"
    qbf-lang[ 6] = " M. ПижйЩсйЬак ДиЪШйащд"
    qbf-lang[ 7] = " Q. ПижйЩсйЬак ПижЩжвщд"
    qbf-lang[ 8] = " S. ПицЪиШггШ ДайШЪрЪук/Пижфцд"

    qbf-lang[11] = " G. ВвщййШ"
    qbf-lang[12] = " P. Оиайгцк Дблмзрлщд"
    qbf-lang[13] = " T. ХищгШлШ ОЯцдЮк ТЬигШлабжч"

    qbf-lang[14] = " B. ПицЪиШггШ АдЬчиЬйЮк(ПижЩжвтк)"
    qbf-lang[15] = " D. ПШисгЬлижа ДблмзщйЬрд"
    qbf-lang[16] = " E. ПицЪиШггШ ДеШЪрЪук СлжаоЬхрд"
    qbf-lang[17] = " L. ДзавжЪу ПЬЫхрд ЪаШ ДлабтллЬк"
    qbf-lang[18] = " U. Оиайгцк ПижЪисггШлжк ХиуйлЮ"

    qbf-lang[21] = 'ДзавтелЬ ЬиЪШйхШ у [' + KBLABEL("END-ERROR")
                 + '] ЪаШ лтвжк бШа ШзжЯубЬмйЮ гЬлШЩжвщд.'
    /* these next four have a length limit of 20 including colon */
    qbf-lang[22] = 'АиоЬхШ:'
    qbf-lang[23] = 'ПШисгЬлижа:'
    qbf-lang[24] = 'АйнсвЬаШ:'
    qbf-lang[25] = 'ДиЪШйхЬк:'

    qbf-lang[26] = 'ГаШоЬхиайЮ СмйлугШлжк'
    qbf-lang[27] = 'ДбЫжйЮ'
    qbf-lang[28] = 'ФцилрйЮ лрд Ьзазвтжд зШиШгтлирд ЫаШоЬхиайЮк Шзц '
                 + 'лж ШиоЬхж ПШиШгтлирд.'
    qbf-lang[29] = 'ДзаЩЬЩШхрйЮ ЪаШ лЮд ЬзШдЬЪбШлсйлШйЮ лЮк ЬнШигжЪук'
/* QUIT and RETURN are the PROGRESS keywords and cannot be translated */
    qbf-lang[30] = 'ОлШд ж оиуйлЮк ЬзавтЪЬа "Ттвжк" Шзц лж Шиоабц гЬджч, '
                 + 'ла ЯтвЬлЬ дШ бсдЬа лж зицЪиШггШ ; "Quit" у "Return"'
    qbf-lang[31] = 'ДзаЩЬЩШхрйЮ ЬецЫжм Шзц лж гтджм '  
                 + 'ГаШоЬхиайЮк СмйлугШлжк'
    qbf-lang[32] = 'ДвЬЪожк лЮк Ыжгук лжм ШиоЬхжм ПШиШгтлирд бШа ШзжЯубЬмйЮ '
                 + 'лрд гЬлШЩжвщд.'.

/*--------------------------------------------------------------------------*/

ELSE

/*--------------------------------------------------------------------------*/
IF qbf-s = 5 THEN
  ASSIGN
/*a-perm.p, 1..7 also used by a-form.p and a-print.p*/
    qbf-lang[ 1] = 'ПижйЩсйЬак'
    qbf-lang[ 2] = ' *                         - Овжа жа оиуйлЬк тожмд зицйЩШйЮ.'
    qbf-lang[ 3] = ' <оиуйлЮк>,<оиуйлЮк>,бжб.  - Лцдж Шмлжх жа оиуйлЬк тожмд зицйЩШйЮ.'
    qbf-lang[ 4] = ' !<оиуйлЮк>,!<оиуйлЮк>,*   - Овжа Ьблцк лрд оиЮйлщд Шмлщд тожмд '
                 + 'зицйЩШйЮ.'
    qbf-lang[ 5] = ' acct*                     - Лцдж оиуйлЬк зжм ШиохЭжмд "acct" '
                 + 'тожмд зицйЩШйЮ.'
    qbf-lang[ 6] = 'ГщйлЬ лжмк оиуйлЬк бШлс цджгШ ЬайШЪрЪук (Login ID), ориайгтдШ гЬ '
                 + 'бцггШлШ.'
    qbf-lang[ 7] = 'ТШ ждцгШлШ гзжижчд дШ зЬиатожмд оШиШблуиЬк "гзШвШдлти". Тж ЯШмгШйлабц '
                 + 'ШзжбвЬх.'
                   /* from 8 thru 13, format x(30) */
    qbf-lang[ 8] = 'ДзавтелЬ гхШ ЬиЪШйхШ Шзц лЮ'
    qbf-lang[ 9] = 'вхйлШ ШиайлЬис ЪаШ дШ ЫЮвщйЬлЬ'
    qbf-lang[10] = 'лШ ждцгШлШ оиЮйлщд гЬ зицйЩШйЮ.'
    qbf-lang[11] = 'ДзавтелЬ гхШ вЬалжмиЪхШ Шзц лЮ '
    qbf-lang[12] = 'вхйлШ ШиайлЬис ЪаШ дШ ЫЮвщйЬлЬ '
    qbf-lang[13] = 'лШ ждцгШлШ оиЮйлщд гЬ зицйЩШйЮ.'
    qbf-lang[14] = 'ПШлуйлЬ [' + KBLABEL("END-ERROR")
                 + '] Шнжч бсдЬлЬ лак гЬлШЩжвтк.'
    qbf-lang[15] = 'ПШлуйлЬ [' + KBLABEL("GO") + '] ЪаШ ШзжЯубЬмйЮ, ['
                 + KBLABEL("END-ERROR") + '] ЪаШ ШдсбвЮйЮ.'
    qbf-lang[16] = 'ГЬд гзжиЬхлЬ дШ ШзжбвЬхйЬлЬ лжд ЬШмлц йШк Шзц лЮ ГаШоЬхиайЮ лжм СмйлугШлжк !'
/*a-print.p:*/     /*21 thru 26 must be format x(16) and right-justified */
    qbf-lang[21] = 'ДзШдШнжис(Reset)'
    qbf-lang[22] = '                '
    qbf-lang[23] = '        ЙШдждабу'
    qbf-lang[24] = '    СмдЬзлмЪгтдЮ'  
    qbf-lang[25] = '          ДдлждЮ'
    qbf-lang[26] = ' АбчирйЮ ДдлждЮк'.

/*--------------------------------------------------------------------------*/

ELSE

/*--------------------------------------------------------------------------*/
IF qbf-s = 6 THEN
  ASSIGN
/*a-write.p:*/
    qbf-lang[ 1] = 'ФцилрйЮ зШиШгтлирд ЬиЪШйхШк'
    qbf-lang[ 2] = 'ФцилрйЮ зШиШгтлирд оиргслрд жЯцдЮк'
    qbf-lang[ 3] = 'ФцилрйЮ имЯгхйЬрд Ьблмзрлу'
    qbf-lang[ 4] = 'ФцилрйЮ вхйлШк ШиоЬхрд ЪаШ зижЩжвтк'
    qbf-lang[ 5] = 'ФцилрйЮ вхйлШк йотйЬрд гЬлШеч ШиоЬхрд'
    qbf-lang[ 6] = 'ФцилрйЮ вхйлШк ШмлцгШлЮк ЬзавжЪук зЬЫхрд ЪаШ ЬлабтллЬк'
    qbf-lang[ 7] = 'ФцилрйЮ вхйлШк зижйЩсйЬрд ЪаШ ЬзавжЪтк зижЩжвук'
    qbf-lang[ 8] = 'ФцилрйЮ йлжаоЬхрд лжм зижЪисггШлжк лжм оиуйлЮ'
    qbf-lang[ 9] = 'ФцилрйЮ зижлЬадцгЬдрд зШиШгтлирд ЬблмзщйЬрд лжм ймйлугШлжк'

/* a-color.p*/
                 /* 12345678901234567890123456789012 */
    qbf-lang[11] = '    ХищгШлШ ЪаШ лчзж лЬигШлабжч:' /* must be 32 */
                 /* 1234567890123456789012345 */
    qbf-lang[12] = 'ЛЬджч:          ЙШдждабс:' /* must be 25 */
    qbf-lang[13] = '           ФрлЬаду гзсиШ:'
    qbf-lang[14] = 'ПШисЯ.ГаШвцЪжм: ЙШдждабс:'
    qbf-lang[15] = '           ФрлЬаду гзсиШ:'
    qbf-lang[16] = 'КхйлШ ЬзавжЪщд: ЙШдждабс:'
    qbf-lang[17] = '           ФрлЬаду гзсиШ:'

/*a-field.p*/    /*"----- ----- ----- ----- ----"*/
    qbf-lang[30] = 'Дгнсд ЛЬлШЩ АдШЭ. АдЬчи СЬаи'
    qbf-lang[31] = 'Оа АзжЫЬблтк лагтк ЬхдШа Шзц 1 трк 9999.'
    qbf-lang[32] = 'ЗтвЬлЬ дШ ШзжЯЮбЬчйЬлЬ лак гЬлШЩжвтк зжм бсдЬлЬ йлу '
                 + 'вхйлШ зЬЫхрд; '.

/*--------------------------------------------------------------------------*/

ELSE

/*--------------------------------------------------------------------------*/
IF qbf-s = 8 THEN
/*a-label.p*/
  ASSIGN            /* 1..8 use format x(78) */
                    /* 1 and 8 are available for more explanation, in */
                    /*   case the translation won't fit in 2 thru 7.  */
    qbf-lang[ 1] = 'ГщйлЬ лак жджгШйхЬк зЬЫхрд зжм зЬиатожмд лШ йлжаоЬхШ лЮк '
                 + 'ЫаЬчЯмдйЮк. '
    qbf-lang[ 2] = 'ХиЮйагжзжауйлЬ йчдлШеЮ гжинук CAN-DO йШд гсйбШ ЪаШ дШ '
                 + 'ЩиЬхлЬ лШ зЬЫхШ ("*" '
    qbf-lang[ 3] = 'ШдлайлжаоЬх гЬ тдШд у зШиШзсдр оШиШблуиЬк, "." ШдлайлжаоЬх '
                 + 'гЬ тдШд оШиШблуиШ).'
    qbf-lang[ 4] = 'Амлс лШ йлжаоЬхШ оиЮйагжзжажчдлШа йлЮд ЫЮгажмиЪхШ лрд '
                 + 'зижлЬадцгЬдрд ЬлабЬллщд.'
    qbf-lang[ 5] = 'МШ тоЬлЬ мз''цпад цла гЬиабтк бШлШориуйЬак гзжиЬх дШ зЬиаййЬчжмд '
                 + 'ЫЮвШЫу, Шд '
    qbf-lang[ 6] = 'оиЮйагжзжауйЬлЬ ПцвЮ, Мжгц бШа Т.Й. йШд еЬориайлс зЬЫхШ лцлЬ, '
                 + 'Ю ЪиШггу "П-М-Т "'
    qbf-lang[ 7] = 'звЬждсЭЬа.'
                  /* each entry in list must be <= 5 characters long */
                  /* but may be any portion of address that is applicable */
                  /* in the target country */
    qbf-lang[ 9] = 'ОджгШ,УзцпЮ,ГаЬч1,ГаЬч2,ГаЬч3,Т.Й.,ПцвЮ,Т-П,Мжгцк,ХщиШ'
    qbf-lang[10] = 'Тж ПЬЫхж зжм зЬиатоЬа лЮд ДзрдмгхШ/ОджгШ <ОджгШ>'
    qbf-lang[11] = 'Тж ПЬЫхж зжм зЬиатоЬа лж цджгШ лжм мзЬчЯмджм <УзцпЮ>'
    qbf-lang[12] = 'Тж ПЬЫхж зжм зЬиатоЬа лЮд <зищлЮ> ЪиШггу лЮк ЫаЬчЯмдйЮк (з.о. жЫцк)'
    qbf-lang[13] = 'Тж ПЬЫхж зжм зЬиатоЬа <ЫЬчлЬиЮ> ЪиШггу лЮк ЫаЬчЯмдйЮк (з.о. Тсо.ЗмихЫШ)'
    qbf-lang[14] = 'Тж ПЬЫхж зжм зЬиатоЬа <лихлЮ> ЪиШггу лЮк ЫаЬчЯмдйЮк (зижШаиЬлабц)'
    qbf-lang[15] = 'Тж ПЬЫхж зжм зЬиатоЬа лжд ТШомЫижгабц ЙщЫабШ <Т.Й.>'
    qbf-lang[16] = 'Тж ПЬЫхж зжм зЬиатоЬа лЮд <ПцвЮ>'
    qbf-lang[17] = 'Тж ПЬЫхж зжм зЬиатоЬа <Т.Й.- ПцвЮ> йЬ гхШ ЪиШггу'
    qbf-lang[18] = 'Тж ПЬЫхж зжм зЬиатоЬа лжд джгц <Мжгцк>'
    qbf-lang[19] = 'Тж ПЬЫхж зжм зЬиатоЬа лЮ ощиШ <ХщиШ>'

/*a-join.p*/
    qbf-lang[23] = 'ГЬд ЬзалитзЬлШа Ю "Шмлц-тдрйЮ" лжм ШиоЬхжм Шмлу лЮ йлаЪгу.'
    qbf-lang[24] = 'ДоЬлЬ нлсйЬа йлж циаж ЪаШ Ьдрлабтк йотйЬак гЬлШеч ШиоЬхрд.'
    qbf-lang[25] = 'ДдщйЮ лжм' /* 25 and 26 are automatically */
    qbf-lang[26] = 'гЬ лж'          /*   right-justified           */
    qbf-lang[27] = 'ГщйлЬ лж нхвлиж WHERE у OF : (Шнуйлт лж бЬдц ЪаШ ШбчирйЮ лЮк тдрйЮк)'
    qbf-lang[28] = 'ПШлуйлЬ [' + KBLABEL("END-ERROR") + '] Шнжч бсдЬлЬ лак гЬлШЩжвтк.'
    qbf-lang[30] = 'Ж ймдЯубЮ зитзЬа дШ ШиохйЬа гЬ WHERE у OF.'
    qbf-lang[31] = 'ГщйлЬ лЮд жджгШйхШ лжм зищлжм ШиоЬхжм лЮк тдрйЮк ЪаШ зижйЯубЮ у ШбчирйЮ.'
    qbf-lang[32] = 'ТщиШ, ЫщйлЬ лЮд жджгШйхШ лжм ЫЬчлЬижм ШиоЬхжм лЮк тдрйЮк.'.

/*--------------------------------------------------------------------------*/

ELSE

/*--------------------------------------------------------------------------*/
/* a-form.p */
IF qbf-s = 9 THEN
  ASSIGN           /* 1..6 format x(45) */
    qbf-lang[ 1] = ' A. ПижйЯубЮ МтШк ФцигШк ПижЩжвук'
    qbf-lang[ 2] = ' C. ДзавжЪу ФцигШк ПижЩжвук ЪаШ ЛЬлШЩжву '
    qbf-lang[ 3] = ' G. ВЬдабс ХШиШблЮиайлабс лЮк ФцигШк'
    qbf-lang[ 4] = ' W. ДзавжЪу ПЬЫхрд ЪаШ лЮ ФцигШ'
    qbf-lang[ 5] = ' P. ПижйЩсйЬак '
    qbf-lang[ 6] = ' D. ГаШЪиШну лЮк ТитожмйШк ФцигШк'
    qbf-lang[ 7] = ' ДзавжЪу :' /* format x(10) */
    qbf-lang[ 8] = ' ЛЬлШЩжву:' /* format x(10) */
                 /* cannot changed width of 9..16 from defined below */
    qbf-lang[ 9] = '    ОджгсйаШ ШиоЬхжм DB' /* right-justify 9..14 */
    qbf-lang[10] = '           Тчзжк ФцигШк'
    qbf-lang[11] = '     ПицЪиШггШ ПижЩжвук'
    qbf-lang[12] = 'ОджгШйхШ АиоЬхжм ФцигШк'
    qbf-lang[13] = ' ОджгШйхШ Frame ЪаШ 4GL'
    qbf-lang[14] = '              ПЬиаЪиШну'
    qbf-lang[15] = '(ЗЬриЬхлШа .p)' /* left-justify 15 and 16 */
    qbf-lang[16] = '(ГщйлЬ extension)'
    qbf-lang[18] = 'H ФцигШ тоЬа ~{1~} ЪиШггтк. ДзЬаЫу лж RESULTS ЫЬйгЬчЬа '
                 + 'зтдлЬ ЪиШггтк ЪаШ оиуйЮ лжм аЫхжм, еЬзЬидс лж циаж ЪиШггщд '
                 + 'жЯцдЮк йЬ лЬигШлабц 24x80. ЗтвЬлЬ дШ жихйЬлЬ гаШ нцигШ гЬ '
                 + 'Шмлц лж гтЪЬЯжк; '
    qbf-lang[19] = 'ЖЫЮ мзШиоЬх тдШ зицЪиШггШ зижЩжвук г''Шмлу лЮд жджгШйхШ.'
    qbf-lang[20] = 'Ж ФцигШ зитзЬа дШ мзсиоЬа уЫЮ у дШ тоЬа лЮд бШлсвЮеЮ .f Шд '
                 + 'зицбЬалШа ЪаШ АмлцгШлЮ ГЮгажмиЪхШ.'
    qbf-lang[21] = 'Ж жджгШйхШ лжм "Frame" ЪаШ лжд бщЫабШ 4GL зжм ЫщйШлЬ '
                 + 'ЬхдШа ЫЬйгЬмгтдЮ. ГщйлЬ ЫаШнжиЬлабу жджгШйхШ.'
    qbf-lang[22] = ' ДзавжЪу АиоЬхрд '
    qbf-lang[23] = 'ПШлуйлЬ [' + KBLABEL("END-ERROR") + '] Шнжч бсдЬлЬ лак гЬлШЩжвтк'
    qbf-lang[24] = 'АзжЯубЬмйЮ йлжаоЬхрд лЮк ФцигШк йлЮ БаЩважЯубЮ Фжигщд...'
    qbf-lang[25] = 'ДоЬлЬ гЬлШЩсвЬа лжмвсоайлжд гхШ ФжигШ ПижЩжвук. ЛзжиЬхлЬ дШ '
                 + 'бсдЬлЬ, ЬхлЬ "compile" лЮк ФцигШк лщиШ, ЬхлЬ "ДзШдЬЪбШлсйлШйЮ '
                 + 'ДнШигжЪук" гЬлс.  ЗтвЬлЬ "Compile" лщиШ; '
    qbf-lang[26] = 'ГЬд ЩитЯЮбЬ нцигШ гЬ лЮд ждцгШйаШ "~{1~}".'
                 + 'ЗтвЬлЬ дШ лЮ ЫЮгажмиуйЬлЬ; '
    qbf-lang[27] = 'УзсиоЬа ФцигШ ПижЩжвук гЬ лЮд жджгШйхШ "~{1~}".'
                 + 'ЗтвЬлЬ дШ оиЮйагжзжауйЬлЬ лШ зЬЫхШ зжм Шдубжмд й''Шмлу лЮ ФцигШ; '
    qbf-lang[28] = 'ДзаЩЬЩШхрйЮ ЫаШЪиШнук лЮк ФцигШк ПижЩжвук'
    qbf-lang[29] = '** To ПицЪиШггШ ПижЩжвук - "~{1~}" ЫаШЪиснЮбЬ. **'
    qbf-lang[30] = 'ГЮгажмиЪхШ лЮк ФцигШк ПижЩжвук...'
    qbf-lang[31] = 'ДоЬлЬ нлсйЬа йлж циаж ШзжЯубЬмйЮк ЪаШ ФцигЬк ПижЩжвук.'
    qbf-lang[32] = 'АЫчдШлЮ Ю ЬЪбШлсйлШйЮ лЮк ФцигШк ПижЩжвук Ъа''смлж лж ШиоЬхж.^^ВаШ дШ '
                 + 'ЬЪбШлШйлШЯЬх у нцигШ, ЬхлЬ Ю "ВтнмиШ" зитзЬа дШ мзжйлЮихЭЬа "RECIDs", '
                 + 'ЬхлЬ дШ мзсиоЬа гждШЫабц бвЬаЫх (unique index) ЪаШ лж ШиоЬхж.'.

/*--------------------------------------------------------------------------*/

ELSE

/*--------------------------------------------------------------------------*/
/* a-print.p */
IF qbf-s = 10 THEN
  ASSIGN           /* 1..6 format x(45) */
    qbf-lang[ 1] = ' A. ПижйЯубЮ МтШк ЛждсЫШк ДецЫжм '
    qbf-lang[ 2] = ' C. ДзавжЪу ЛждсЫШк ЪаШ ЛЬлШЩжву '
    qbf-lang[ 3] = ' G. ВЬдабс ХШиШблЮиайлабс лЮк ЛждсЫШк '
    qbf-lang[ 4] = ' S. ХШиШблуиЬк ДвтЪожм '
    qbf-lang[ 5] = ' P. ПижйЩсйЬак Дблмзрлщд '
    qbf-lang[ 6] = ' D. ГаШЪиШну лЮк ТитожмйШк ЛждсЫШк '
    qbf-lang[ 7] = ' ДзавжЪу: ' /* format x(10) */
    qbf-lang[ 8] = ' ЛЬлШЩжву:' /* format x(10) */
    qbf-lang[ 9] = 'Оа АзжЫЬблтк лагтк ЬхдШа Шзц 1 трк 255.'
    qbf-lang[10] = 'O Тчзжк зитзЬа дШ ЬхдШа term, thru, to, view, file, page у prog'
    qbf-lang[11] = 'ДоЬлЬ нлсйЬа йлж циаж ЪаШ ЛждсЫЬк ДецЫжм.'
    qbf-lang[12] = 'Лцдж О Тчзжк ЛждсЫШк "term" гзциЬа дШ тоЬа тежЫж йЬ TERMINAL.'
    qbf-lang[13] = 'ГЬд ЩитЯЮбЬ Ю жджгШйхШ зижЪисггШлжк гЬ лж литожд PROPATH.'
                  /*17 thru 20 must be format x(16) and right-justified */
    qbf-lang[17] = 'ПЬиаЪиШну вхйлШк'
    qbf-lang[18] = 'ОдШгШйхШ ЛждсЫШк'
    qbf-lang[19] = '   ЛтЪайлж Дчижк'
    qbf-lang[20] = '           Тчзжк'
    qbf-lang[21] = 'БвтзЬ зШиШбслр'
    qbf-lang[22] = 'TERMINAL, цзрк OUTPUT TO TERMINAL PAGED'
    qbf-lang[23] = 'TO зицк гждсЫШ, цзрк OUTPUT TO PRINTER'
    qbf-lang[24] = 'THROUGH гтйр spooler у нхвлиж UNIX у OS/2'
    qbf-lang[25] = 'СлтвдЬа лЮд ЬблчзрйЮ йЬ ШиоЬхж, бШа гЬлс ЬблЬвЬх Шмлц лж зицЪиШггШ'
    qbf-lang[26] = 'ЕЮлс лЮд жджгШйхШ лжм ШиоЬхжм ЬецЫжм Шзц лжд оиуйлЮ'
    qbf-lang[27] = 'АввШЪу йЬвхЫШк гЬ зижЮЪжчгЬдЮ/ЬзцгЬдЮ жЯцдЮ (prev-page бШа next-page)'
    qbf-lang[28] = 'ЙвуйЮ зижЪисггШлжк 4GL ЪаШ лЮд Шиоу/лтвжк лЮк ижук ЬецЫжм'
    qbf-lang[30] = 'ПШлуйлЬ [' + KBLABEL("END-ERROR") + '] Шнжч бсдЬлЬ лак гЬлШЩжвтк'
    qbf-lang[31] = 'ПитзЬа дШ мзсиоЬа лжмвсоайлжд гхШ ЛждсЫШ ДецЫжм !'
    qbf-lang[32] = 'ДзаЩЬЩШхрйЮ ЫаШЪиШнук лжм Ьблмзрлу'.

/*--------------------------------------------------------------------------*/

RETURN.
