/*********************************************************************
* Copyright (C) 2000 by Progress Software Corporation. All rights    *
* reserved. Prior versions of this work may contain portions         *
* contributed by participants of Possenet.                           *
*                                                                    *
*********************************************************************/
/* t-l-eng.p - English language definitions for Labels module */

{ prores/t-define.i }

DEFINE INPUT PARAMETER qbf-s AS INTEGER NO-UNDO.

IF qbf-s < 0 THEN RETURN.
qbf-lang = "".

/*--------------------------------------------------------------------------*/
/* l-guess.p:1..5,l-verify.p:6.. */
IF qbf-s = 1 THEN
  ASSIGN
    qbf-lang[ 1] = 'АдШЭулЮйЮ йлж "~{1~}" гЬ лЮд жджгШйхШ зЬЫхжм "~{2~}" ...'
    qbf-lang[ 2] = 'ГЬд ЩитЯЮбШд зтЫаШ бШлс лЮд АмлцгШлЮ АдШЭулЮйЮ.'
    qbf-lang[ 4] = 'ГЮгажмиЪхШ лрд ПЬЫхрд ЪаШ лак ЬлабтллЬк'
    qbf-lang[ 5] = 'ОджгШ,УзцпЮ,ГаЬчЯмдйЮ #1,ГаЬчЯмдйЮ #2,ГаЬчЯмдйЮ #3,Т.Й.,'
                 + 'ПцвЮ,Т.Й. бШа ПцвЮ гШЭх,Мжгцк,ХщиШ'

    qbf-lang[ 6] = 'ВиШггу ~{1~}: КЬхзЬа/Ьзазвтжд сЪбайлиж.'
    qbf-lang[ 7] = 'ВиШггу ~{2~}: ГЬд ЩитЯЮбЬ лж зЬЫхж "~{1~}".'
    qbf-lang[ 8] = 'ВиШггу ~{2~}: Тж зЬЫхж "~{1~}", ЫЬд ЬхдШа лчзжм зхдШбШ.'
    qbf-lang[ 9] = 'ВиШггу ~{2~}: Слж зЬЫхж "~{1~}", звуЯжк - ~{3~} мзЬиЩШхдЬа лж гтЪайлж циаж.'
    qbf-lang[10] = 'ВиШггу ~{2~}: Тж зЬЫхж "~{1~}", зижтиоЬлШа Шзц гЮ-ЬзавЬЪгтдж ШиоЬхж.'.

ELSE

/*--------------------------------------------------------------------------*/
/* l-main.p */
IF qbf-s = 2 THEN
  ASSIGN
    /* each entry of 1 and also 2 must fit in format x(6) */
    qbf-lang[ 1] = 'Аио. :,     :,     :,     :,     :'
    qbf-lang[ 2] = 'ТШеад:'
    qbf-lang[ 3] = 'СлжаоЬхШ ДлабЬллщд'
    qbf-lang[ 4] = 'СоЬЫхШйЮ ДлабЬллщд'
    qbf-lang[ 5] = 'ДзавжЪу ПЬЫхжм'
    /*cannot change length of 6 thru 17, right-justify 6-11,13-14 */
    qbf-lang[ 6] = 'АнШхи.ЙЬдщд ВиШг:'
    qbf-lang[ 7] = ' Азц зцйЬк нжитк:'
    qbf-lang[ 8] = ' Смджвабц Упжк:'
    qbf-lang[ 9] = 'Псдр ПЬиаЯщиаж:'
    qbf-lang[10] = 'АзцйлШйЮ гЬлШеч Длаб.:'
    qbf-lang[11] = 'Дйжоу Аиай.ПЬиаЯрихжм:'
    qbf-lang[12] = '(звсл.)'
    qbf-lang[13] = 'ЙЬхгЬдж Длаб.'
    qbf-lang[14] = '    бШа ПЬЫхШ'
    qbf-lang[15] = 'АиаЯгцк           ' /* 15..17 used as group.   */
    qbf-lang[16] = 'ДлабЬллщд         ' /*   do not change length, */
    qbf-lang[17] = 'бШлс Пвслжк: ' /*        but do right-justify  */
    qbf-lang[19] = 'ГЬд тоЬлЬ ШбмищйЬа лЮд литожмйШ ЬлабтллШ. '
                 + 'ЗтвЬлЬ дШ ймдЬохйЬлЬ; '
    qbf-lang[20] = 'Тж чпжк лрд ЬлабЬллщд ЬхдШа ~{1~}, Шввс тоЬлЬ жихйЬа ~{2~} '
                 + 'ЪиШггтк гЬ зЬЫхШ бШа бЬхгЬдж. ГЮвШЫу, гЬиабс йлжаоЬхШ ЫЬд '
                 + 'ЯШ оритйжмд бШа ймдЬзщк, ЫЬд ЯШ ЬблмзрЯжчд. '
                 + 'ЗтвЬлЬ дШ ймдЬохйЬлЬ гЬ лЮд ЬблчзрйЮ; '
    qbf-lang[21] = 'ГЬд мзсиожмд зтЫаШ у бЬхгЬдж ЪаШ лЮд ЬблчзрйЮ !'
    qbf-lang[22] = 'ГЮгажмиЪхШ лжм зицЪиШггШлжк ДблчзрйЮк ДлабЬллщд...'
    qbf-lang[23] = '"Compile" лжм зицЪиШггШлжк ДблчзрйЮк ДлабЬллщд...'
    qbf-lang[24] = 'ДблтвЬйЮ лжм зижЪисггШлжк зжм ЫЮгажмиЪуЯЮбЬ...'
    qbf-lang[25] = 'АЫчдШлЮ Ю ЬзабжадрдхШ гЬ лж ШиоЬхж/гждсЫШ'
    qbf-lang[26] = 'АиаЯгцк Ьблмзргтдрд ЬлабЬллщд - ~{1~} .'
    qbf-lang[27] = 'F. ПЬЫхШ'
    qbf-lang[28] = 'A. ДдЬиЪс АиоЬхШ'
    qbf-lang[29] = 'ЗтвЬлЬ лЮд ЬблтвЬйЮ лЮк АмлцгШлЮк АдШЭулЮйЮк ПЬЫхрд '
                 + 'Шзц Шмлц лж зицЪиШггШ; '
    qbf-lang[31] = 'ДзаЩЬЩШхрйЮ ШбчирйЮк лрд имЯгхйЬрд'
    qbf-lang[32] = 'ДзаЩЬЩШхрйЮ ЬецЫжм Шзц Шмлуд лЮд ЬиЪШйхШ'.

ELSE

/*--------------------------------------------------------------------------*/
/* l-main.p */
IF qbf-s = 3 THEN
  ASSIGN
    qbf-lang[ 1] = 'Дн''цйжд ЯтвЬлЬ > 1 ЬлабтллШ бШлс звслжк, лШ бЬдс зитзЬа > 0'
    qbf-lang[ 2] = 'Тж зсдр зЬиаЯщиаж ЫЬд гзжиЬх дШ тоЬа ШидЮлабу лагу'
    qbf-lang[ 3] = 'Тж ймджвабц чпжк зитзЬа дШ ЬхдШа > 1'
    qbf-lang[ 4] = 'ПитзЬа дШ мзсиоЬа лжмвсоайлжд гаШ ЬлабтллШ бШлс звслжк'
    qbf-lang[ 5] = 'ПитзЬа дШ ЬблмзрЯЬх лжмвсоайлжд Шзц гхШ нжис'
    qbf-lang[ 6] = 'Тж ШиайлЬиц зЬиаЯщиаж ЫЬд гзжиЬх дШ тоЬа ШидЮлабу лагу'
    qbf-lang[ 7] = 'Ж жиаЭцдлаШ ШзцйлШйЮ гЬлШеу ЬлабЬллщд зитзЬа дШ ЬхдШа > 1'
    qbf-lang[ 8] = 'ЛЬлШлцзайЮ лрд Ъисггрд зижк лШ зсдр цлШд мзсиоЬа бЬду ЪиШггу'
    qbf-lang[ 9] = 'АиаЯгцк бЬдщд ЪиШггщд Шзц лЮд Шиоу гтоиЮ лж бЬхгЬдж'
    qbf-lang[10] = 'Тж ймджвабц чпжк лЮк ЬлабтллШк йЬ ЪиШггтк'
    qbf-lang[11] = 'ПцйЬк ЬлабтллЬк ЯШ ЬблмзрЯжчд бШлс звслжк'
    qbf-lang[12] = 'ПцйЬк нжитк ЯШ ЬблмзрЯЬх Ю бсЯЬ ЬлабтллШ'
    qbf-lang[13] = 'ПцйШ бЬдс Шзц лЮд сбиЮ лЮк ЬлабтллШк гтоиа лжд зищлж оШиШблуиШ'
    qbf-lang[14] = 'Ж ШзцйлШйЮ Шзц лЮд ШиайлЬиу сбиЮ гхШк ЬлабтллШк бШа лЮк сввЮк'.
/*--------------------------------------------------------------------------*/

RETURN.
