/*********************************************************************
* Copyright (C) 2000 by Progress Software Corporation ("PSC"),       *
* 14 Oak Park, Bedford, MA 01730, and other contributors as listed   *
* below.  All Rights Reserved.                                       *
*                                                                    *
* The Initial Developer of the Original Code is PSC.  The Original   *
* Code is Progress IDE code released to open source December 1, 2000.*
*                                                                    *
* The contents of this file are subject to the Possenet Public       *
* License Version 1.0 (the "License"); you may not use this file     *
* except in compliance with the License.  A copy of the License is   *
* available as of the date of this notice at                         *
* http://www.possenet.org/license.html                               *
*                                                                    *
* Software distributed under the License is distributed on an "AS IS"*
* basis, WITHOUT WARRANTY OF ANY KIND, either express or implied. You*
* should refer to the License for the specific language governing    *
* rights and limitations under the License.                          *
*                                                                    *
* Contributors:                                                      *
*                                                                    *
*********************************************************************/
/* t-r-eng.p - English language definitions for Reports module */

{ prores/t-define.i }

DEFINE INPUT PARAMETER qbf-s AS INTEGER NO-UNDO.

IF qbf-s < 0 THEN RETURN.
qbf-lang = "".

IF qbf-s = 1 THEN
  ASSIGN
/*r-header.p*/
    qbf-lang[ 1] = 'Δώστε το κείμενο για την'
    qbf-lang[ 2] = 'Γραμμή' /* must be < 8 characters */
                   /* 3..7 are format x(64) */
    qbf-lang[ 3] = 'Συναρτήσεις για το κείμενο της επικεφαλίδας και '
                 + 'υποσημείωσης'
    qbf-lang[ 4] = '~{COUNT~}  Μετρητής εγγραφών      :  '
                 + '~{TIME~}  Ωρα εκκίνησης'
    qbf-lang[ 5] = '~{TODAY~}  Σημερινή ημερομηνία    :  '
                 + '~{NOW~}   Τρέχουσα ώρα'
    qbf-lang[ 6] = '~{PAGE~}  Αριθ. τρέχουσας σελίδας :  '
                 + '~{USER~}  Ονομα Χρήστης'
    qbf-lang[ 7] = '~{VALUE <πεδίο>~;<μορφή>~} για προσθήκη πεδίων'
                 + ' (πατήστε [' + KBLABEL("GET") + '])'
    qbf-lang[ 8] = 'Επιλογή πεδίου για παρεμβολή'
    qbf-lang[ 9] = 'Πατήστε [' + KBLABEL("GO") + '] αποθήκευση, ['
                 + KBLABEL("GET") + '] προσθήκη πεδίου, ['
                 + KBLABEL("END-ERROR") + '] ανάκληση.'

/*r-total.p*/    /*"|---------------------------|"*/
    qbf-lang[12] = 'να γίνουν οι πράξεις:'
                 /*"|--------------------------------------------|"*/
    qbf-lang[13] = 'Οταν η τιμή του πεδίου μεταβάλλεται:'
                 /*"|---| |---| |---| |---| |---|" */
    qbf-lang[14] = 'Σύνολ Μέτρ. Κατώτ Μέγισ Μέση '
    qbf-lang[15] = 'Γραμμή Συνόλων'
    qbf-lang[16] = 'Για πεδίο:'
    qbf-lang[17] = 'Επιλογή Πεδίου για Αθροισμα'

/*r-calc.p*/
    qbf-lang[18] = 'Επιλογή Στήλης για Τρέχον Σύνολο'
    qbf-lang[19] = 'Επιλογή Στήλης για Ποσοστό του Συνόλου'
    qbf-lang[20] = 'Τρέχον Σύνολο'
    qbf-lang[21] = '% Συνόλου'
    qbf-lang[22] = 'Αλφαριθμητικό,Ημερομηνία,Λογικό,Υπολογιστικό,Αριθμητικό'
    qbf-lang[23] = ''
    qbf-lang[24] = 'Δώστε την αρχική τίμη για τον μετρητή'
    qbf-lang[25] = 'Δώστε το βήμα αύξησης ή αρνητική τιμή για αφαίρεση'
    qbf-lang[26] = 'Μετρητές'
    qbf-lang[27] = 'Μετρητής'
                 /*"------------------------------|"*/
    qbf-lang[28] = '        Αρχική τιμή για μετρητή' /*right justify*/
    qbf-lang[29] = '  Βήμα αύξησης για κάθε εγγραφή' /*right justify*/
    qbf-lang[32] = 'Εχετε ήδη ορίσει τον μέγιστο αριθμό στηλών.'.

ELSE

/*--------------------------------------------------------------------------*/
IF qbf-s = 2 THEN
  ASSIGN
/* r-space.p */  /*"------------------------------|  ---------|  |------"*/
    qbf-lang[ 1] = '            Επιλογή                Τρέχουσα  Προτειν'
    /* 2..8 must be less than 32 characters long */
    qbf-lang[ 2] = 'Αριστερό περιθώριο'
    qbf-lang[ 3] = 'Κενά μεταξύ στηλών'
    qbf-lang[ 4] = 'Αρχική γραμμή'
    qbf-lang[ 5] = 'Γραμμές ανα σελίδα'
    qbf-lang[ 6] = 'Εκτύπωση γραμμών άνα'
    qbf-lang[ 7] = 'Γραμμές μεταξύ επικεφ./κειμένου'
    qbf-lang[ 8] = 'Γραμμές μεταξύ κειμένου/Υποσημ.'
                  /*1234567890123456789012345678901*/
    qbf-lang[ 9] = 'Διαστήματα'
    qbf-lang[10] = 'Πρέπει να γίνεται σε κάθε γραμμή (1) μέχρι και το μέγεθος σελίδας'
    qbf-lang[11] = 'Δεν επιτρέπονται αρνητικές τιμές'
    qbf-lang[12] = 'Πρεπει να αρχίσει η εκτύπωση απο τη στήλη 1 και πάνω'
    qbf-lang[13] = 'Η τιμή πρέπει να είναι σε λογικά πλαίσια !'
    qbf-lang[14] = 'Πρεπεί να αρχίσει η εκτύπωση από την πρώτη γραμμή και κάτω'

/*r-set.p*/        /* format x(30) for 15..22 */
    qbf-lang[15] = 'F.  Μορφές Πεδίων/Ονομασίες'
    qbf-lang[16] = 'P.  Προώθηση Σελίδας'
    qbf-lang[17] = 'T.  Συγκεντρωτική Εκτύπωση'
    qbf-lang[18] = 'S.  Διαστήματα'
    qbf-lang[19] = 'LH. Αριστερή Επικεφαλίδα'
    qbf-lang[20] = 'CH. Κεντρική Επικεφαλίδα'
    qbf-lang[21] = 'RH. Δεξιά Επικεφαλίδα'
    qbf-lang[22] = 'LF. Αριστερή Υποσημείωση'
    qbf-lang[23] = 'CF. Κεντρική Υποσημείωση'
    qbf-lang[24] = 'RF. Δεξιά Υποσημείωση'
    qbf-lang[25] = 'FO. Επικεφαλίδα Πρώτης σελ.'
    qbf-lang[26] = 'LO. Υποσημείωση Τελευτ. σελ.'
    qbf-lang[32] = 'Πατήστε [' + KBLABEL("END-ERROR")
                 + '] αφού κάνετε τις μεταβολές.'.

ELSE

/*--------------------------------------------------------------------------*/
IF qbf-s = 3 THEN
  ASSIGN
    /* r-main.p,s-page.p */
    qbf-lang[ 1] = 'Αρχ. :,     :,     :,     :,     :'
    qbf-lang[ 2] = 'Ταξιν:'
    qbf-lang[ 3] = 'Στοιχεία Εκτύπωσης'
    qbf-lang[ 4] = 'Σχεδίαση Εκτύπωσης'
    qbf-lang[ 5] = 'συνέχ' /* for <<more and more>> */
    qbf-lang[ 6] = 'Πλάτος,Εκτύπωσης' /* each word comma-separated */
    qbf-lang[ 7] = '< και > για οριζόντια ολίσθηση αριστερά & δεξιά'
    qbf-lang[ 8] = 'Αδύνατη η δημιουργία εκτύπωσης με πλάτος πάνω από '
                 + '255 χαρακτήρες'
    qbf-lang[ 9] = 'Δεν έχετε ακυρώσει την τρέχουσα Εκτύπωση. '
                 + 'Θέλετε να συνεχίσετε; '
    qbf-lang[10] = 'Δημιουργία προγράμματος...'
    qbf-lang[11] = '"Compile" του Προγράμματος Εκτύπωσης...'
    qbf-lang[12] = 'Εκτέλεση του προγράμματος που δημιουργήθηκε...'
    qbf-lang[13] = 'Αδύνατη η επικοινωνία με το αρχείο/μονάδα'
    qbf-lang[14] = 'Επιβεβαίωση ακύρωσης του ορισμού της τρέχουσας '
                 + 'Εκτύπωσης'
    qbf-lang[15] = 'Επιβεβαίωση εξόδου από την τρέχουσα εργασία'
    qbf-lang[16] = 'Πατήστε ['
                 + (IF KBLABEL("CURSOR-UP") BEGINS "CTRL-" THEN 'CURSOR-UP'
                   ELSE KBLABEL("CURSOR-UP"))
                 + '] και ['
                 + (IF KBLABEL("CURSOR-DOWN") BEGINS "CTRL-" THEN 'CURSOR-DOWN'
                   ELSE KBLABEL("CURSOR-DOWN"))
                 + '] για ολίσθηση, ['
                 + KBLABEL("END-ERROR") + '] για τέλος.'
    qbf-lang[17] = 'Σελίδα'
    qbf-lang[18] = '~{1~} εγγραφές στην εκτύπωση.'
    qbf-lang[19] = 'Αδύνατη η δημιουργία της Συγκεντρωτικής Εκτύπωσης χωρίς τον καθορισμό '
                 + 'της ταξινόμησης πεδίων.'
    qbf-lang[20] = 'Αδύνατη η δημιουργία της Συγκεντρωτικής Εκτύπωσης με '
                 + 'κατακόρυφους πίνακες.'
    qbf-lang[21] = 'Μόνο Αθροίσεις'
    qbf-lang[23] = 'Αδύνατη η δημιουργία εκτύπωσης χωρίς τον ορισμό πεδίων.'.

ELSE

/*--------------------------------------------------------------------------*/
/* FAST TRACK interface test for r-ft.p r-ftsub.p */
IF qbf-s = 4 THEN
  ASSIGN
    qbf-lang[ 1] = 'Το FAST TRACK δεν υποστηρίζει τη ροή εξόδου προς τερματικό όταν '
    qbf-lang[ 2] = 'ο χρήστης ορίζει τιμές στην ώρα εκτέλεσης. Αλλαγή ροής εξόδου στον PRINTER.'
    qbf-lang[ 3] = 'Επεξεργασία των επικεφαλίδων/υποσημειώσεων...'
    qbf-lang[ 4] = 'Δημιουργία ομάδων εγγραφών...'
    qbf-lang[ 5] = 'Δημιουργία πεδίων και αθροίσεων...'
    qbf-lang[ 6] = 'Δημιουργία αρχείων και φίλτρα WHERE...'
    qbf-lang[ 7] = 'Δημιουργία επικεφαλίδων και υποσημειώσεων...'
    qbf-lang[ 8] = 'Δημιουργία γραμμών της εκτύπωσης...'
    qbf-lang[ 9] = 'Υπάρχει ήδη μία εκτύπωση με ονομασία ~{1~} στο FAST TRACK. '
                 + 'Θέλετε να την επικαλύψετε; '
    qbf-lang[10] = 'Επικάλυψη εκτύπωσης...'
    qbf-lang[11] = 'Θέλετε να εκτελέσετε το FAST TRACK; '
    qbf-lang[12] = 'Δώστε την ονομασία'
    qbf-lang[13] = 'Το FAST TRACK δεν υποστηρίζει TIME σε επικεφαλίδες/υποσημειώσεις, '
                 + 'αντικατάσταση με NOW.'
    qbf-lang[14] = 'Το FAST TRACK δεν υποστηρίζει το ποσοστό του συνόλου, το πεδίο παραλείπεται'
    qbf-lang[15] = 'Το FAST TRACK δεν υποστηρίζει ~{1~} σε επικεφαλίδα/υποσημείωση, '
                 + '~{2~} παραλείπεται.'
    qbf-lang[16] = 'Η ονομασία εκτύπωσης μπορεί να περιέχει μόνο αλφαριθμητικούς χαρακτήρες ή '
                 + 'ή "_"'
    qbf-lang[17] = 'Ονομασία εκτύπωσης στο FAST TRACK:'
    qbf-lang[18] = 'Η εκτύπωση δεν μεταφέρθηκε στο FAST TRACK'
    qbf-lang[19] = 'Εκτέλεση του FAST TRACK, παρακαλώ περιμένετε...'
    qbf-lang[20] = 'Επιπλέον άγκιστρα στην επικεφαλίδα/υποσημείωση, '
                 + 'ή εκτύπωση ΔΕΝ μεταφέρθηκε.'
    qbf-lang[21] = 'Το FAST TRACK δεν υποστηρίζει μόνο-πρώτο/μόνο-τελευταίο επικεφαλίδες.'
                 + 'Παραλείπεται.'
    qbf-lang[22] = 'Προσοχή: Αρχική τιμή ~{1~} χρησιμοποιήθηκε για τον μετρητή.'
    qbf-lang[23] = 'ΠΕΡΙΕΧΕΙ'
    qbf-lang[24] = 'TOTAL,COUNT,MAX,MIN,AVG'
    qbf-lang[25] = 'Το FAST TRACK δεν υποστηρίζει Συγκεντρωτικές Εκτυπώσεις.'
                 + 'H εκτύπωση ΔΕΝ μεταφέρθηκε.'
    qbf-lang[26] = 'Αδύνατη η μεταφορά εκτύπωσης στο FAST TRACK χωρίς τον ορισμό '
                 + 'αρχείων ή πεδίων.'.


ELSE

/*--------------------------------------------------------------------------*/

IF qbf-s = 5 THEN
  ASSIGN
    /* r-short.p */
    qbf-lang[ 1] = 'Η Συγκεντρωτική Εκτύπωση παρουσιάζει μόνο τα αθροιστικά'
                 + 'στοιχεία. Με βάση το τελευταίο πεδίο στη λίστα "Ταξινόμησης", '
                 + 'μία νέα γραμμή θα τυπώνεται κάθε φορά που η τιμή του πέδιου '
                 + 'ταξινόμησης αλλάζει.^Για την συγκεκριμένη εκτύπωση, μία νέα γράμμη θα '
                 + 'τυπώνεται κάθε φορά που το πεδίο ~{1~} αλλάζει.^Θέλετε να καθορίσετε '
                 + 'την εκτύπωση ώστε να παρουσιάζει μόνο τις αθροίσεις; '
    qbf-lang[ 2] = 'ΝΑΙ'
    qbf-lang[ 3] = 'ΟΧΙ'
    qbf-lang[ 4] = 'Αδύνατη η επιλογή "Συγκεντρωτική Εκτύπωση" χωρίς να έχετε'
                 + 'καθορίσει πως θα γίνει η ταξινόμηση τών πεδίων.^^'
                 + 'Επιλέξτε "Ταξινόμηση" από το μενού Εκτυπώσεων και επιλέξτε '
                 + 'τα πεδία, ορίζοντας αύξουσα ή φθίνουσα σειρά για το καθένα '
                 + 'και μετά δώστε αυτή την επιλογή ξανά.'
    qbf-lang[ 5] = 'Η λίστα περιέχει όλα τα πεδία που έχετε επιλέξει για την '
                 + 'εκτύπωση.'
    qbf-lang[ 6] = 'Ο αστερίσκος δηλώνει ότι μόνο τα αθροιστικά στοιχεία θα '
                 + 'εκτυπωθούν.'
    qbf-lang[ 7] = 'Αν επιλέξετε αριθμητικό πέδιο, ένα υποσύνολο θα εκτυπωθεί '
                 + 'κάθε φορά που η τιμή του πεδίου ~{1~}'
                 + 'αλλάζει.'
    qbf-lang[ 8] = 'Αν επιλέξετε ένα μη-αριθμητικό πεδίο, ένας μετρητής θα '
                 + 'εκτυπωθεί δηλώνοντας τον αριθμό εγγραφών σε κάθε ομάδα του ~{1~}.'
    qbf-lang[ 9] = 'Σε περίπτωση που δεν επιλέξετε πεδίο, η τιμή του τελευταίου '
                 + 'πεδίου της ομάδας θα εκτυπωθεί.'

    /* r-page.p */
    qbf-lang[26] = 'Προώθηση Σελίδας'
    qbf-lang[27] = "Χωρίς προώθηση σελίδας"

    qbf-lang[28] = 'Οταν κάποια τιμή των παρακάτω πεδίων'
    qbf-lang[29] = 'αλλάζει, η εκτύπωση μπορεί να συνεχισθεί'
    qbf-lang[30] = 'σε μία νέα σελίδα αυτόματα.'
    qbf-lang[31] = 'Επιλέξτε το πεδίο από τη παρακάτω λίστα'
    qbf-lang[32] = 'όπου θέλετε την προώθηση της σελίδας.'.

/*--------------------------------------------------------------------------*/

RETURN.
