/*********************************************************************
* Copyright (C) 2000 by Progress Software Corporation. All rights    *
* reserved. Prior versions of this work may contain portions         *
* contributed by participants of Possenet.                           *
*                                                                    *
*********************************************************************/
/* t-r-eng.p - English language definitions for Reports module */

{ prores/t-define.i }

DEFINE INPUT PARAMETER qbf-s AS INTEGER NO-UNDO.

IF qbf-s < 0 THEN RETURN.
qbf-lang = "".

IF qbf-s = 1 THEN
  ASSIGN
/*r-header.p*/
    qbf-lang[ 1] = 'ГщйлЬ лж бЬхгЬдж ЪаШ лЮд'
    qbf-lang[ 2] = 'ВиШггу' /* must be < 8 characters */
                   /* 3..7 are format x(64) */
    qbf-lang[ 3] = 'СмдШилуйЬак ЪаШ лж бЬхгЬдж лЮк ЬзабЬнШвхЫШк бШа '
                 + 'мзжйЮгЬхрйЮк'
    qbf-lang[ 4] = '~{COUNT~}  ЛЬлиЮлук ЬЪЪиШнщд      :  '
                 + '~{TIME~}  ЧиШ ЬббхдЮйЮк'
    qbf-lang[ 5] = '~{TODAY~}  СЮгЬиаду ЮгЬижгЮдхШ    :  '
                 + '~{NOW~}   ТитожмйШ щиШ'
    qbf-lang[ 6] = '~{PAGE~}  АиаЯ. литожмйШк йЬвхЫШк :  '
                 + '~{USER~}  ОджгШ ХиуйлЮк'
    qbf-lang[ 7] = '~{VALUE <зЬЫхж>~;<гжину>~} ЪаШ зижйЯубЮ зЬЫхрд'
                 + ' (зШлуйлЬ [' + KBLABEL("GET") + '])'
    qbf-lang[ 8] = 'ДзавжЪу зЬЫхжм ЪаШ зШиЬгЩжву'
    qbf-lang[ 9] = 'ПШлуйлЬ [' + KBLABEL("GO") + '] ШзжЯубЬмйЮ, ['
                 + KBLABEL("GET") + '] зижйЯубЮ зЬЫхжм, ['
                 + KBLABEL("END-ERROR") + '] ШдсбвЮйЮ.'

/*r-total.p*/    /*"|---------------------------|"*/
    qbf-lang[12] = 'дШ Ъхджмд жа зисеЬак:'
                 /*"|--------------------------------------------|"*/
    qbf-lang[13] = 'ОлШд Ю лагу лжм зЬЫхжм гЬлШЩсввЬлШа:'
                 /*"|---| |---| |---| |---| |---|" */
    qbf-lang[14] = 'Счджв Лтли. ЙШлщл ЛтЪай ЛтйЮ '
    qbf-lang[15] = 'ВиШггу Смдцврд'
    qbf-lang[16] = 'ВаШ зЬЫхж:'
    qbf-lang[17] = 'ДзавжЪу ПЬЫхжм ЪаШ АЯижайгШ'

/*r-calc.p*/
    qbf-lang[18] = 'ДзавжЪу СлувЮк ЪаШ Титожд Счджвж'
    qbf-lang[19] = 'ДзавжЪу СлувЮк ЪаШ Пжйжйлц лжм Смдцвжм'
    qbf-lang[20] = 'Титожд Счджвж'
    qbf-lang[21] = '% Смдцвжм'
    qbf-lang[22] = 'АвнШиаЯгЮлабц,ЖгЬижгЮдхШ,КжЪабц,УзжвжЪайлабц,АиаЯгЮлабц'
    qbf-lang[23] = ''
    qbf-lang[24] = 'ГщйлЬ лЮд Шиоабу лхгЮ ЪаШ лжд гЬлиЮлу'
    qbf-lang[25] = 'ГщйлЬ лж ЩугШ ШчеЮйЮк у ШидЮлабу лагу ЪаШ ШнШхиЬйЮ'
    qbf-lang[26] = 'ЛЬлиЮлтк'
    qbf-lang[27] = 'ЛЬлиЮлук'
                 /*"------------------------------|"*/
    qbf-lang[28] = '        Аиоабу лагу ЪаШ гЬлиЮлу' /*right justify*/
    qbf-lang[29] = '  БугШ ШчеЮйЮк ЪаШ бсЯЬ ЬЪЪиШну' /*right justify*/
    qbf-lang[32] = 'ДоЬлЬ уЫЮ жихйЬа лжд гтЪайлж ШиаЯгц йлЮвщд.'.

ELSE

/*--------------------------------------------------------------------------*/
IF qbf-s = 2 THEN
  ASSIGN
/* r-space.p */  /*"------------------------------|  ---------|  |------"*/
    qbf-lang[ 1] = '            ДзавжЪу                ТитожмйШ  ПижлЬад'
    /* 2..8 must be less than 32 characters long */
    qbf-lang[ 2] = 'АиайлЬиц зЬиаЯщиаж'
    qbf-lang[ 3] = 'ЙЬдс гЬлШеч йлЮвщд'
    qbf-lang[ 4] = 'Аиоабу ЪиШггу'
    qbf-lang[ 5] = 'ВиШггтк ШдШ йЬвхЫШ'
    qbf-lang[ 6] = 'ДблчзрйЮ ЪиШггщд сдШ'
    qbf-lang[ 7] = 'ВиШггтк гЬлШеч ЬзабЬн./бЬагтджм'
    qbf-lang[ 8] = 'ВиШггтк гЬлШеч бЬагтджм/УзжйЮг.'
                  /*1234567890123456789012345678901*/
    qbf-lang[ 9] = 'ГаШйлугШлШ'
    qbf-lang[10] = 'ПитзЬа дШ ЪхдЬлШа йЬ бсЯЬ ЪиШггу (1) гтоиа бШа лж гтЪЬЯжк йЬвхЫШк'
    qbf-lang[11] = 'ГЬд ЬзалитзждлШа ШидЮлабтк лагтк'
    qbf-lang[12] = 'ПиЬзЬа дШ ШиохйЬа Ю ЬблчзрйЮ Шзж лЮ йлувЮ 1 бШа зсдр'
    qbf-lang[13] = 'Ж лагу зитзЬа дШ ЬхдШа йЬ вжЪабс звШхйаШ !'
    qbf-lang[14] = 'ПиЬзЬх дШ ШиохйЬа Ю ЬблчзрйЮ Шзц лЮд зищлЮ ЪиШггу бШа бслр'

/*r-set.p*/        /* format x(30) for 15..22 */
    qbf-lang[15] = 'F.  Лжинтк ПЬЫхрд/ОджгШйхЬк'
    qbf-lang[16] = 'P.  ПижщЯЮйЮ СЬвхЫШк'
    qbf-lang[17] = 'T.  СмЪбЬдлирлабу ДблчзрйЮ'
    qbf-lang[18] = 'S.  ГаШйлугШлШ'
    qbf-lang[19] = 'LH. АиайлЬиу ДзабЬнШвхЫШ'
    qbf-lang[20] = 'CH. ЙЬдлиабу ДзабЬнШвхЫШ'
    qbf-lang[21] = 'RH. ГЬеас ДзабЬнШвхЫШ'
    qbf-lang[22] = 'LF. АиайлЬиу УзжйЮгЬхрйЮ'
    qbf-lang[23] = 'CF. ЙЬдлиабу УзжйЮгЬхрйЮ'
    qbf-lang[24] = 'RF. ГЬеас УзжйЮгЬхрйЮ'
    qbf-lang[25] = 'FO. ДзабЬнШвхЫШ ПищлЮк йЬв.'
    qbf-lang[26] = 'LO. УзжйЮгЬхрйЮ ТЬвЬмл. йЬв.'
    qbf-lang[32] = 'ПШлуйлЬ [' + KBLABEL("END-ERROR")
                 + '] Шнжч бсдЬлЬ лак гЬлШЩжвтк.'.

ELSE

/*--------------------------------------------------------------------------*/
IF qbf-s = 3 THEN
  ASSIGN
    /* r-main.p,s-page.p */
    qbf-lang[ 1] = 'Аио. :,     :,     :,     :,     :'
    qbf-lang[ 2] = 'ТШеад:'
    qbf-lang[ 3] = 'СлжаоЬхШ ДблчзрйЮк'
    qbf-lang[ 4] = 'СоЬЫхШйЮ ДблчзрйЮк'
    qbf-lang[ 5] = 'ймдто' /* for <<more and more>> */
    qbf-lang[ 6] = 'Пвслжк,ДблчзрйЮк' /* each word comma-separated */
    qbf-lang[ 7] = '< бШа > ЪаШ жиаЭцдлаШ жвхйЯЮйЮ ШиайлЬис & ЫЬеас'
    qbf-lang[ 8] = 'АЫчдШлЮ Ю ЫЮгажмиЪхШ ЬблчзрйЮк гЬ звслжк зсдр Шзц '
                 + '255 оШиШблуиЬк'
    qbf-lang[ 9] = 'ГЬд тоЬлЬ ШбмищйЬа лЮд литожмйШ ДблчзрйЮ. '
                 + 'ЗтвЬлЬ дШ ймдЬохйЬлЬ; '
    qbf-lang[10] = 'ГЮгажмиЪхШ зижЪисггШлжк...'
    qbf-lang[11] = '"Compile" лжм ПижЪисггШлжк ДблчзрйЮк...'
    qbf-lang[12] = 'ДблтвЬйЮ лжм зижЪисггШлжк зжм ЫЮгажмиЪуЯЮбЬ...'
    qbf-lang[13] = 'АЫчдШлЮ Ю ЬзабжадрдхШ гЬ лж ШиоЬхж/гждсЫШ'
    qbf-lang[14] = 'ДзаЩЬЩШхрйЮ ШбчирйЮк лжм жиайгжч лЮк литожмйШк '
                 + 'ДблчзрйЮк'
    qbf-lang[15] = 'ДзаЩЬЩШхрйЮ ЬецЫжм Шзц лЮд литожмйШ ЬиЪШйхШ'
    qbf-lang[16] = 'ПШлуйлЬ ['
                 + (IF KBLABEL("CURSOR-UP") BEGINS "CTRL-" THEN 'CURSOR-UP'
                   ELSE KBLABEL("CURSOR-UP"))
                 + '] бШа ['
                 + (IF KBLABEL("CURSOR-DOWN") BEGINS "CTRL-" THEN 'CURSOR-DOWN'
                   ELSE KBLABEL("CURSOR-DOWN"))
                 + '] ЪаШ жвхйЯЮйЮ, ['
                 + KBLABEL("END-ERROR") + '] ЪаШ лтвжк.'
    qbf-lang[17] = 'СЬвхЫШ'
    qbf-lang[18] = '~{1~} ЬЪЪиШнтк йлЮд ЬблчзрйЮ.'
    qbf-lang[19] = 'АЫчдШлЮ Ю ЫЮгажмиЪхШ лЮк СмЪбЬдлирлабук ДблчзрйЮк орихк лжд бШЯжиайгц '
                 + 'лЮк лШеадцгЮйЮк зЬЫхрд.'
    qbf-lang[20] = 'АЫчдШлЮ Ю ЫЮгажмиЪхШ лЮк СмЪбЬдлирлабук ДблчзрйЮк гЬ '
                 + 'бШлШбцимнжмк зхдШбЬк.'
    qbf-lang[21] = 'Лцдж АЯижхйЬак'
    qbf-lang[23] = 'АЫчдШлЮ Ю ЫЮгажмиЪхШ ЬблчзрйЮк орихк лжд жиайгц зЬЫхрд.'.

ELSE

/*--------------------------------------------------------------------------*/
/* FAST TRACK interface test for r-ft.p r-ftsub.p */
IF qbf-s = 4 THEN
  ASSIGN
    qbf-lang[ 1] = 'Тж FAST TRACK ЫЬд мзжйлЮихЭЬа лЮ ижу ЬецЫжм зижк лЬигШлабц цлШд '
    qbf-lang[ 2] = 'ж оиуйлЮк жихЭЬа лагтк йлЮд щиШ ЬблтвЬйЮк. АввШЪу ижук ЬецЫжм йлжд PRINTER.'
    qbf-lang[ 3] = 'ДзЬеЬиЪШйхШ лрд ЬзабЬнШвхЫрд/мзжйЮгЬащйЬрд...'
    qbf-lang[ 4] = 'ГЮгажмиЪхШ жгсЫрд ЬЪЪиШнщд...'
    qbf-lang[ 5] = 'ГЮгажмиЪхШ зЬЫхрд бШа ШЯижхйЬрд...'
    qbf-lang[ 6] = 'ГЮгажмиЪхШ ШиоЬхрд бШа нхвлиШ WHERE...'
    qbf-lang[ 7] = 'ГЮгажмиЪхШ ЬзабЬнШвхЫрд бШа мзжйЮгЬащйЬрд...'
    qbf-lang[ 8] = 'ГЮгажмиЪхШ ЪиШггщд лЮк ЬблчзрйЮк...'
    qbf-lang[ 9] = 'УзсиоЬа уЫЮ гхШ ЬблчзрйЮ гЬ жджгШйхШ ~{1~} йлж FAST TRACK. '
                 + 'ЗтвЬлЬ дШ лЮд ЬзабШвчпЬлЬ; '
    qbf-lang[10] = 'ДзабсвмпЮ ЬблчзрйЮк...'
    qbf-lang[11] = 'ЗтвЬлЬ дШ ЬблЬвтйЬлЬ лж FAST TRACK; '
    qbf-lang[12] = 'ГщйлЬ лЮд жджгШйхШ'
    qbf-lang[13] = 'Тж FAST TRACK ЫЬд мзжйлЮихЭЬа TIME йЬ ЬзабЬнШвхЫЬк/мзжйЮгЬащйЬак, '
                 + 'ШдлабШлсйлШйЮ гЬ NOW.'
    qbf-lang[14] = 'Тж FAST TRACK ЫЬд мзжйлЮихЭЬа лж зжйжйлц лжм ймдцвжм, лж зЬЫхж зШиШвЬхзЬлШа'
    qbf-lang[15] = 'Тж FAST TRACK ЫЬд мзжйлЮихЭЬа ~{1~} йЬ ЬзабЬнШвхЫШ/мзжйЮгЬхрйЮ, '
                 + '~{2~} зШиШвЬхзЬлШа.'
    qbf-lang[16] = 'Ж жджгШйхШ ЬблчзрйЮк гзжиЬх дШ зЬиатоЬа гцдж ШвнШиаЯгЮлабжчк оШиШблуиЬк у '
                 + 'у "_"'
    qbf-lang[17] = 'ОджгШйхШ ЬблчзрйЮк йлж FAST TRACK:'
    qbf-lang[18] = 'Ж ЬблчзрйЮ ЫЬд гЬлШнтиЯЮбЬ йлж FAST TRACK'
    qbf-lang[19] = 'ДблтвЬйЮ лжм FAST TRACK, зШиШбШвщ зЬиагтдЬлЬ...'
    qbf-lang[20] = 'Дзазвтжд сЪбайлиШ йлЮд ЬзабЬнШвхЫШ/мзжйЮгЬхрйЮ, '
                 + 'у ЬблчзрйЮ ГДМ гЬлШнтиЯЮбЬ.'
    qbf-lang[21] = 'Тж FAST TRACK ЫЬд мзжйлЮихЭЬа гцдж-зищлж/гцдж-лЬвЬмлШхж ЬзабЬнШвхЫЬк.'
                 + 'ПШиШвЬхзЬлШа.'
    qbf-lang[22] = 'Пижйжоу: Аиоабу лагу ~{1~} оиЮйагжзжауЯЮбЬ ЪаШ лжд гЬлиЮлу.'
    qbf-lang[23] = 'ПДРИДХДИ'
    qbf-lang[24] = 'TOTAL,COUNT,MAX,MIN,AVG'
    qbf-lang[25] = 'Тж FAST TRACK ЫЬд мзжйлЮихЭЬа СмЪбЬдлирлабтк ДблмзщйЬак.'
                 + 'H ЬблчзрйЮ ГДМ гЬлШнтиЯЮбЬ.'
    qbf-lang[26] = 'АЫчдШлЮ Ю гЬлШнжис ЬблчзрйЮк йлж FAST TRACK орихк лжд жиайгц '
                 + 'ШиоЬхрд у зЬЫхрд.'.


ELSE

/*--------------------------------------------------------------------------*/

IF qbf-s = 5 THEN
  ASSIGN
    /* r-short.p */
    qbf-lang[ 1] = 'Ж СмЪбЬдлирлабу ДблчзрйЮ зШижмйасЭЬа гцдж лШ ШЯижайлабс'
                 + 'йлжаоЬхШ. ЛЬ ЩсйЮ лж лЬвЬмлШхж зЬЫхж йлЮ вхйлШ "ТШеадцгЮйЮк", '
                 + 'гхШ дтШ ЪиШггу ЯШ лмзщдЬлШа бсЯЬ нжис зжм Ю лагу лжм зтЫажм '
                 + 'лШеадцгЮйЮк ШввсЭЬа.^ВаШ лЮд ймЪбЬбиагтдЮ ЬблчзрйЮ, гхШ дтШ ЪисггЮ ЯШ '
                 + 'лмзщдЬлШа бсЯЬ нжис зжм лж зЬЫхж ~{1~} ШввсЭЬа.^ЗтвЬлЬ дШ бШЯжихйЬлЬ '
                 + 'лЮд ЬблчзрйЮ щйлЬ дШ зШижмйасЭЬа гцдж лак ШЯижхйЬак; '
    qbf-lang[ 2] = 'МАИ'
    qbf-lang[ 3] = 'ОХИ'
    qbf-lang[ 4] = 'АЫчдШлЮ Ю ЬзавжЪу "СмЪбЬдлирлабу ДблчзрйЮ" орихк дШ тоЬлЬ'
                 + 'бШЯжихйЬа зрк ЯШ ЪхдЬа Ю лШеадцгЮйЮ лщд зЬЫхрд.^^'
                 + 'ДзавтелЬ "ТШеадцгЮйЮ" Шзц лж гЬджч ДблмзщйЬрд бШа ЬзавтелЬ '
                 + 'лШ зЬЫхШ, жихЭждлШк ШчежмйШ у нЯхджмйШ йЬаис ЪаШ лж бШЯтдШ '
                 + 'бШа гЬлс ЫщйлЬ Шмлу лЮд ЬзавжЪу еШдс.'
    qbf-lang[ 5] = 'Ж вхйлШ зЬиатоЬа цвШ лШ зЬЫхШ зжм тоЬлЬ ЬзавтеЬа ЪаШ лЮд '
                 + 'ЬблчзрйЮ.'
    qbf-lang[ 6] = 'О ШйлЬихйбжк ЫЮвщдЬа цла гцдж лШ ШЯижайлабс йлжаоЬхШ ЯШ '
                 + 'ЬблмзрЯжчд.'
    qbf-lang[ 7] = 'Ад ЬзавтеЬлЬ ШиаЯгЮлабц зтЫаж, тдШ мзжйчджвж ЯШ ЬблмзрЯЬх '
                 + 'бсЯЬ нжис зжм Ю лагу лжм зЬЫхжм ~{1~}'
                 + 'ШввсЭЬа.'
    qbf-lang[ 8] = 'Ад ЬзавтеЬлЬ тдШ гЮ-ШиаЯгЮлабц зЬЫхж, тдШк гЬлиЮлук ЯШ '
                 + 'ЬблмзрЯЬх ЫЮвщдждлШк лжд ШиаЯгц ЬЪЪиШнщд йЬ бсЯЬ жгсЫШ лжм ~{1~}.'
    qbf-lang[ 9] = 'СЬ зЬихзлрйЮ зжм ЫЬд ЬзавтеЬлЬ зЬЫхж, Ю лагу лжм лЬвЬмлШхжм '
                 + 'зЬЫхжм лЮк жгсЫШк ЯШ ЬблмзрЯЬх.'

    /* r-page.p */
    qbf-lang[26] = 'ПижщЯЮйЮ СЬвхЫШк'
    qbf-lang[27] = "Хрихк зижщЯЮйЮ йЬвхЫШк"

    qbf-lang[28] = 'ОлШд бсзжаШ лагу лрд зШиШбслр зЬЫхрд'
    qbf-lang[29] = 'ШввсЭЬа, Ю ЬблчзрйЮ гзжиЬх дШ ймдЬоайЯЬх'
    qbf-lang[30] = 'йЬ гхШ дтШ йЬвхЫШ ШмлцгШлШ.'
    qbf-lang[31] = 'ДзавтелЬ лж зЬЫхж Шзц лЮ зШиШбслр вхйлШ'
    qbf-lang[32] = 'цзжм ЯтвЬлЬ лЮд зижщЯЮйЮ лЮк йЬвхЫШк.'.

/*--------------------------------------------------------------------------*/

RETURN.
