/*********************************************************************
* Copyright (C) 2000 by Progress Software Corporation ("PSC"),       *
* 14 Oak Park, Bedford, MA 01730, and other contributors as listed   *
* below.  All Rights Reserved.                                       *
*                                                                    *
* The Initial Developer of the Original Code is PSC.  The Original   *
* Code is Progress IDE code released to open source December 1, 2000.*
*                                                                    *
* The contents of this file are subject to the Possenet Public       *
* License Version 1.0 (the "License"); you may not use this file     *
* except in compliance with the License.  A copy of the License is   *
* available as of the date of this notice at                         *
* http://www.possenet.org/license.html                               *
*                                                                    *
* Software distributed under the License is distributed on an "AS IS"*
* basis, WITHOUT WARRANTY OF ANY KIND, either express or implied. You*
* should refer to the License for the specific language governing    *
* rights and limitations under the License.                          *
*                                                                    *
* Contributors:                                                      *
*                                                                    *
*********************************************************************/
/* t-s-eng.p - English language definitions for general system use */

{ prores/t-define.i }

DEFINE INPUT PARAMETER qbf-s AS INTEGER NO-UNDO.

IF qbf-s < 0 THEN RETURN.
qbf-lang = "".

/*--------------------------------------------------------------------------*/

/* l-edit.p,s-edit.p */
IF qbf-s = 1 THEN
  ASSIGN
    qbf-lang[ 1] = 'Insert'
    qbf-lang[ 2] = 'ДзаЩЬЩШхрйЮ ЬецЫжм орихк ШзжЯубЬмйЮ'
    qbf-lang[ 3] = 'ГщйлЬ лЮд жджгШйхШ лжм ШиоЬхжм ЪаШ ймЪощдЬмйЮ'
    qbf-lang[ 4] = 'ГщйлЬ лжмк оШиШблуиЬк ЪаШ ШдШЭулЮйЮ'
    qbf-lang[ 5] = 'ДзавжЪу зЬЫхжм ЪаШ зШиЬгЩжву'
    qbf-lang[ 6] = 'ПШлуйлЬ [' + KBLABEL("GO") + '] ШзжЯубЬмйЮ, ['
		 + KBLABEL("GET") + '] зижйЯубЮ зЬЫхжм, ['
		 + KBLABEL("END-ERROR") + '] ШдсбвЮйЮ.'
    qbf-lang[ 7] = 'ГЬд ЩитЯЮбЬ бШлс лЮд ШдШЭулЮйЮ.'.

ELSE

/*--------------------------------------------------------------------------*/

/* s-ask.p,s-where.p */
IF qbf-s = 2 THEN
  ASSIGN
    qbf-lang[ 1] = 'ИйжчлШа гЬ'
    qbf-lang[ 2] = 'ГЬд ИйжчлШа гЬ'
    qbf-lang[ 3] = 'ЛабицлЬиж Шзц'
    qbf-lang[ 4] = 'ЛабицлЬиж у хйж'
    qbf-lang[ 5] = 'ЛЬЪШвчлЬиж Шзц'
    qbf-lang[ 6] = 'ЛЬЪШвчлЬиж у хйж'
    qbf-lang[ 7] = 'АиохЭЬа Шзц'
    qbf-lang[ 8] = 'ПЬиатоЬа'    /* must match [r.4.23] */
    qbf-lang[ 9] = 'АдлайлжаоЬх гЬ'

    qbf-lang[10] = 'ДзавжЪу зЬЫхжм'
    qbf-lang[11] = 'ПисеЮ'
    qbf-lang[12] = 'ДзавтелЬ лагу'
    qbf-lang[13] = 'СмЪбихйЬак'

    qbf-lang[14] = 'ЙШЯжиайгцк лагук Шзц лжд оиуйлЮ йлЮд щиШ ЬблтвЬйЮк.'
    qbf-lang[15] = 'ГщйлЬ лЮд ЬищлЮйЮ зжм ЯШ ЬгнШдайлЬх йлЮд щиШ ЬблтвЬйЮк :'

    qbf-lang[16] = 'ЙШЯжиайгцк лагук гжинук' /* data-type */
    qbf-lang[17] = ''

    qbf-lang[18] = 'ПШлуйлЬ [' + KBLABEL("END-ERROR") + '] ЪаШ лтвжк.'
    qbf-lang[19] = 'ПШлуйлЬ [' + KBLABEL("END-ERROR") + '] ЪаШ ШдсбвЮйЮ.'
    qbf-lang[20] = 'ПШлуйлЬ [' + KBLABEL("GET") + '] ЪаШ АгЬйж Оиайгц.'

    qbf-lang[21] = 'ДзавтелЬ лЮ гжину йчЪбиайЮк ЪаШ лж зЬЫхж.'

    qbf-lang[22] = 'ГщйлЬ лЮ лагу, гжинук ~{1~} ЪаШ йчЪбиайЮ гЬ "~{2~}".'
    qbf-lang[23] = 'ГщйлЬ лЮ лагу гжинук ~{1~} ЪаШ "~{2~}".'
    qbf-lang[24] = 'ПШлуйлЬ [' + KBLABEL("PUT")
		 + '] ЪаШ бШЯжиайгц Шзц лжд оиуйлЮ йлЮд щиШ ЬблтвЬйЮк.'
    qbf-lang[25] = 'СчдлШеЮ:Тж  ~{1~} ЬхдШа ~{2~} бсзжаШ лагу, гжинук ~{3~}.'

    qbf-lang[27] = 'О АгЬйжк Оиайгцк ЫЬд ймдЬиЪсЭЬлШа гЬ лжд бШЯжиагц лагук '
		 + 'Шзц лжд оиуйлЮ йлЮд щиШ ЬблтвЬйЮк. ХиЮйагжзжауйлЬ гцдж лж тдШ.'
    qbf-lang[28] = 'Ж лагу зитзЬа дШ ЬхдШа Ъдрйлу !'
    qbf-lang[29] = 'ГщйлЬ сввЬк лагтк ЪаШ' /* '?' append to string */
    qbf-lang[30] = 'ЗтвЬлЬ дШ жихйЬлЬ сввШ биалуиаШ ЬзавжЪук; '
    qbf-lang[31] = 'О ймдЫаШйгцк гЬ лШ зижЮЪжчгЬдШ биалуиаШ дШ ЪхдЬа гЬ'
    qbf-lang[32] = 'АгЬйж Оиайгц'.

ELSE

/*--------------------------------------------------------------------------*/
IF qbf-s = 3 THEN
  ASSIGN
/* s-info.p, s-format.p */
    qbf-lang[ 1] = 'ТШеадцгЮйЮ бШлс'  /* s-info.p automatically right-justifies */
    qbf-lang[ 2] = 'бШа бШлс'    /*   1..9 and adds colons for you. */
    qbf-lang[ 3] = 'АиоЬхж'      /* but must fit in format x(24) */
    qbf-lang[ 4] = 'Ддрлабу йотйЮ'
    qbf-lang[ 5] = 'Озжм'
    qbf-lang[ 6] = 'ПЬЫхж'
    qbf-lang[ 7] = 'ПисеЮ'
    qbf-lang[ 9] = 'ПШисвЬапЮ ДзШдШв.лагщд; '

    qbf-lang[10] = 'АПО,АМА,АПО'
    qbf-lang[11] = 'ГЬд тоЬлЬ ЬзавтеЬа лШ ШиоЬхШ !'
    qbf-lang[12] = 'Лжинтк ПЬЫхрд бШа ОджгШйхЬк'
    qbf-lang[13] = 'Лжинтк'
    qbf-lang[14] = 'ДзавжЪу ПЬЫхжм' /* also used by s-calc.p below */
    /* 15..18 must be format x(16) (see notes on 1..7) */
    qbf-lang[15] = 'ОджгШйхШ'
    qbf-lang[16] = 'Лжину'
    qbf-lang[17] = 'Database'
    qbf-lang[18] = 'Тчзжк'
    qbf-lang[19] = 'ПижЮЪжчгЬджк оицджк ЬблтвЬйЮк,вЬзлс:ЫЬмлЬицвЬзлШ'
    qbf-lang[20] = 'Ж лагу зитзЬа дШ ЬхдШа Ъдрйлу (?)'

/*s-calc.p*/ /* there are many more for s-calc.p, see qbf-s = 5 thru 8 */
/*s-calc.p also uses #14 */
    qbf-lang[27] = 'ГЮгажмиЪхШ ПиШеЬрд'
    qbf-lang[28] = 'ПисеЮ'
    qbf-lang[29] = 'ЗЬвЬлЬ дШ зижйЯтлЬлЬ сввШ йлжаоЬхШ й''Шмлу лЮ зисеЮ; '
    qbf-lang[30] = 'ДзавжЪу КЬалжмиЪхШк'
    qbf-lang[31] = 'Ю йЮгЬиаду ЮгЬижгЮдхШ'
    qbf-lang[32] = 'йлШЯЬиу лагу'.

ELSE

/*--------------------------------------------------------------------------*/

IF qbf-s = 4 THEN
  ASSIGN
/*s-help.p*/
    qbf-lang[ 1] = 'ГЬд мзсиоЬа ЩжуЯЬаШ Ъа''Шмлу лЮд ЬзавжЪу.'
    qbf-lang[ 2] = 'БжуЯЬаШ'

/*s-order.p*/
    qbf-lang[15] = 'АчежмйШ/ФЯхджмйШ' /*neither can be over 8 characters */
    qbf-lang[16] = 'ВаШ лж бШЯтдШ ЫщйлЬ "А" ЪаШ ШчежмйШ йЬаис'
    qbf-lang[17] = 'у "Ф" ЪаШ нЯхджмйШ йЬаис.'

/*s-define.p*/
    qbf-lang[21] = 'W. Пвслжк/Лжину лрд ПЬЫхрд'
    qbf-lang[22] = 'F. ПЬЫхШ'
    qbf-lang[23] = 'A. ДдЬиЪс АиоЬхШ'
    qbf-lang[24] = 'T. АЯижхйгШлШ бШа УзжйчджвШ'
    qbf-lang[25] = 'R. Титожд Счджвж'
    qbf-lang[26] = 'P. Пжйжйлц лжм Смдцвжм'
    qbf-lang[27] = 'C. ЛЬлиЮлтк'
    qbf-lang[28] = 'M. ЛШЯЮгШлабтк ПисеЬак'
    qbf-lang[29] = 'S. ПисеЬак гЬ АвнШиаЯгЮлабс'
    qbf-lang[30] = 'N. ПисеЬак гЬ АиаЯгЮлабс'
    qbf-lang[31] = 'D. ПисеЬак гЬ ЖгЬижгЮдхЬк'
    qbf-lang[32] = 'L. КжЪабтк ПисеЬак'.

ELSE

/*--------------------------------------------------------------------------*/

/* s-calc.p - string expressions */
IF qbf-s = 5 THEN
  ASSIGN
    qbf-lang[ 1] = 's,СлШЯЬиц у ПЬЫхж,s00=s24,~{1~}'
    qbf-lang[ 2] = 's,Substring,s00=s25n26n27,SUBSTRING(~{1~}'
		 + ';INTEGER(~{2~});INTEGER(~{3~}))'
    qbf-lang[ 3] = 's,СмдЫаШйгцк Ычж АвнШиаЯгЮлабщд,s00=s28s29,~{1~} + ~{2~}'
    qbf-lang[ 4] = 's,СмдЫаШйгцк лиащд АвнШиаЯгЮлабщд,s00=s28s29s29,'
		 + '~{1~} + ~{2~} + ~{3~}'
    qbf-lang[ 5] = 's,СмдЫаШйгцк лЬййсирд АвнШиаЯгЮлабщд,s00=s28s29s29s29,'
		 + '~{1~} + ~{2~} + ~{3~} + ~{4~}'
    qbf-lang[ 6] = 's,Тж габицлЬиж Ычж АвнШиаЯгЮлабщд,s00=s30s31,MINIMUM(~{1~};~{2~})'
    qbf-lang[ 7] = 's,Тж гЬЪШвчлЬиж Ычж АвнШиаЯгЮлабщд,s00=s30s31,MAXIMUM(~{1~};~{2~})'
    qbf-lang[ 8] = 's,Лубжк АвнШиаЯгЮлабжч,n00=s32,LENGTH(~{1~})'
    qbf-lang[ 9] = 's,ОджгШ ХиуйлЮ (User ID),s00=,USERID("RESULTSDB")'
    qbf-lang[10] = 's,ТитожмйШ щиШ,s00=,STRING(TIME;"HH:MM:SS")'

    qbf-lang[24] = 'ГщйлЬ лЮд жджгШйхШ зЬЫхжм зжм ЯШ ЬгнШдайЯЬх йЬ дтШ йлувЮ '
		 + 'йлЮд ЬблчзрйЮ у ЬзавтелЬ <<йлШЯЬиу лагу>> ЪаШ дШ зШиЬгЩсввЬлЬ '
		 + 'тдШ ШвнШиаЯгЮлабц гЬ йлШЯЬиу лагу.'
    qbf-lang[25] = 'Тж SUBSTRING йШк ЫхдЬа лЮ ЫмдШлцлЮлШ дШ ШзжгждщйЬлЬ тдШ '
		 + 'лгугШ Ьдцк ШвнШиаЯгЮлабжч ЪаШ ЬгнсдайЮ. ДзавтелЬ лЮд '
		 + 'жджгШйхШ зЬЫхжм.'  
    qbf-lang[26] = 'ЙШЯжихйлЬ лжд зищлж оШиШблуиШ лжм лгугШлжк лжм ШвнШиаЯгЮлабжч'
    qbf-lang[27] = 'ГщйлЬ лжд ШиаЯгц оШиШблуирд зжм ЯтвЬлЬ дШ ШзжгждщйЬлЬ'
    qbf-lang[28] = 'ДзавтелЬ лЮд зищлЮ лагу'
    qbf-lang[29] = 'ДзавтелЬ лЮд ЬзцгЬдЮ лагу'
    qbf-lang[30] = 'ДзавтелЬ лжд зищлж йлжаоЬхж ЪаШ йчЪбиайЮ'
    qbf-lang[31] = 'ДзавтелЬ лж ЫЬчлЬиж йлжаоЬхж ЪаШ йчЪбиайЮ'
    qbf-lang[32] = 'О ШиаЯгцк зжм ЫхдЬлШа ШдлайлжаоЬх йлж губжк лжм ЬзавЬЪгтджм '
		 + 'ШвнШиаЯгЮлабжч.'.

ELSE

/*--------------------------------------------------------------------------*/

/* s-calc.p - numeric expressions */
IF qbf-s = 6 THEN
  ASSIGN
    qbf-lang[ 1] = 'n,СлШЯЬиц у ПЬЫхж,n00=n26,~{1~}'
    qbf-lang[ 2] = 'n,Тж ЛабицлЬиж Ычж ШиаЯгщд,n00=n24n25,MINIMUM(~{1~};~{2~})'
    qbf-lang[ 3] = 'n,Тж ЛЬЪШвчлЬиж Ычж ШиаЯгщд,n00=n24n25,MAXIMUM(~{1~};~{2~})'
    qbf-lang[ 4] = 'n,Узцвжазж ГаШхиЬйЮк (MOD),n00=n31n32,~{1~} MODULO ~{2~}'
    qbf-lang[ 5] = 'n,АзцвмлЮ Тагу,n00=n27,'
		 + '(IF ~{1~} < 0 THEN - ~{1~} ELSE ~{1~})'
    qbf-lang[ 6] = 'n,СлижЪЪмвжзжхЮйЮ,n00=n28,ROUND(~{1~};0)'
    qbf-lang[ 7] = 'n,ПЬиабжзу,n00=n29,TRUNCATE(~{1~};0)'
    qbf-lang[ 8] = 'n,ТЬлиШЪрдабу РхЭШ,n00=n30,SQRT(~{1~})'
    qbf-lang[ 9] = 'n,ДгнсдайЮ лЮк щиШк,s00=n23,STRING(INTEGER(~{1~});"HH:MM:SS")'

    qbf-lang[23] = 'ДзавтелЬ лж зтЫаж ЪаШ ЬгнсдайЮ рк HH:MM:SS'
    qbf-lang[24] = 'ДзавтелЬ лж зищлж йлжаоЬхж ЪаШ йчЪбиайЮ'
    qbf-lang[25] = 'ДзавЬелЬ лж ЫЬчлЬиж йлжаоЬхж ЪаШ йчЪбиайЮ'
    qbf-lang[26] = 'ГщйлЬ лЮд жджгШйхШ зЬЫхжм зжм ЯШ ЬгнШдайЯЬх йЬ дтШ йлувЮ '
		 + 'йлЮд ЬблчзрйЮ у ЬзавтелЬ <<йлШЯЬиу лагу>> ЪаШ дШ зШиЬгЩсвЬлЬ '
		 + 'гхШ йлШЯЬиу ШиаЯгЮлабу лагу.'
    qbf-lang[27] = 'ДзавтелЬ ЬдШ зЬЫхж зжм ЯШ ЬгнШдайЯЬх рк ШзцвмлЮ лагу '
		 + '(орихк зицйЮгж).'
    qbf-lang[28] = 'ДзавтелЬ тдШ зЬЫхж зжм ЯШ йлицЪЪмвжзжаЮЯЬх йлж звЮйатйлЬиж ШбтиШаж.'
    qbf-lang[29] = 'ДзавтелЬ тдШ зЬЫхж ЪаШ зЬиабжзу (ШнШхиЬйЮ лжм ЫЬбШЫабжч гтижк).'
    qbf-lang[30] = 'ДзавтелЬ тдШ зЬЫхж ЪаШ мзжвжЪайгц лЮк лЬлиШЪрдабук ихЭШк.'
    qbf-lang[31] = 'Тж мзцвжазж лЮк зисеЮк : ЫаШаиЬлтжк / ЫаШаитлЮк = зЮвхбж '
		 + '+ мзцвжазж.  ГщйлЬ лжд ЫаШаиЬлтж'
    qbf-lang[32] = 'ГщйлЬ лжд ЫаШаитлЮ'.

ELSE

/*--------------------------------------------------------------------------*/

/* s-calc.p - date expressions */
IF qbf-s = 7 THEN
  ASSIGN
    qbf-lang[ 1] = 'd,СЮгЬиаду ЖгЬижгЮдхШ,d00=,TODAY'
    qbf-lang[ 2] = 'd,ПижйЯубЮ ЖгЬищд йЬ ЖгЬижгЮдхШ,d00=d22n23,~{1~} + ~{2~}'
    qbf-lang[ 3] = 'd,АнШхиЬйЮ ЖгЬищд Шзц ЖгЬижгЮдхШ,d00=d22n24,~{1~} - ~{2~}'
    qbf-lang[ 4] = 'd,ГаШнжис гЬлШеч Ычж ЖгЬижгЮдащд,n00=d25d26,~{1~} - ~{2~}'
    qbf-lang[ 5] = 'd,Ж ПижЪЬдтйлЬиЮ Ымж ЖгЬижгЮдащд,d00=d20d21,MINIMUM(~{1~};~{2~})'
    qbf-lang[ 6] = 'd,Ж ЛЬлШЪЬдтйлЬиЮ Ычж ЖгЬижгЮдащд,d00=d20d21,MAXIMUM(~{1~};~{2~})'
    qbf-lang[ 7] = 'd,Ж ЮгтиШ рк ШиаЯгцк,n00=d27,DAY(~{1~})'
    qbf-lang[ 8] = 'd,Тж ЛудШ рк ШиаЯгцк,n00=d28,MONTH(~{1~})'
    qbf-lang[ 9] = 'd,Ж ОджгШйхШ лжм ЛудШ,s00=d29,ENTRY(MONTH(~{1~});"ИШджмсиажк'
		 + ';ФЬЩижмсиажк;Лсилажк;Азихважк;ЛШфжк;Ижчдажк;Ижчважк;АчЪжмйлжк;СЬзлтгЩиажк'
		 + ';ОблщЩиажк;МжтгЩиажк;ГЬбтгЩиажк")'
    qbf-lang[10] = 'd,Тж Длжк рк АиаЯгцк,n00=d30,YEAR(~{1~})'
    qbf-lang[11] = 'd,Ж ЖгтиШ лЮк ДЩЫжгсЫШк,n00=d31,WEEKDAY(~{1~})'
    qbf-lang[12] = 'd,Ж ОджгШйхШ лЮк ЖгтиШк,s00=d32,ENTRY(WEEKDAY(~{1~});"'
		 + 'ЙмиаШбу;ГЬмлтиШ;ТихлЮ;ТЬлсилЮ;ПтгзлЮ;ПШиШйбЬму;СсЩЩШлж")'

    qbf-lang[20] = 'ДзавтелЬ лж зищлж йлжаоЬхж ЪаШ йчЪбиайЮ'
    qbf-lang[21] = 'ДзавтелЬ лж ЫЬчлЬиж йлжаоЬхж ЪаШ йчЪбиайЮ'
    qbf-lang[22] = 'ДзавтелЬ лж зЬЫхж ЮгЬижгЮдхШк.'
    qbf-lang[23] = 'ДзавтелЬ лж зЬЫхж зжм зЬиатоЬа лжд ШиаЯгц ЮгЬищд зжм '
		 + 'ЯШ зижйлЬЯЬх йлЮд ЮгЬижгЮдхШ.'
    qbf-lang[24] = 'ДзавтелЬ лж зЬЫхж зжм зЬиатоЬа лжд ШиаЯгц ЮгЬищд зжм '
		 + 'ЯШ ШнШаиЬЯЬх Шзц лЮд ЮгШижгЮдхШ.'
    qbf-lang[25] = 'СчЪбиайЮ Ычж ЮгЬижгЮдащд бШа Ю ЬгнсдайЮ йлувЮк зжм зЬиатоЬа '
		 + 'лЮ ЫаШнжис гЬлШеч лжмк, йЬ ЮгтиЬк.  ДзавтелЬ лж '
		 + 'зищлж зЬЫхж.'
    qbf-lang[26] = 'ДзавтелЬ лж ЫЬчлЬиж зЬЫхж ЮгЬижгЮдхШк.'
    qbf-lang[27] = 'Ж ЮгтиШ лжм гудШ рк ШиаЯгцк Шзц '
		 + '1 трк 31.'
    qbf-lang[28] = 'Тж гудШ лжм тлжмк рк ШиаЯгцк Шзц '
		 + '1 трк 12.'
    qbf-lang[29] = 'Ж жджгШйхШ лжм гудШ.'
    qbf-lang[30] = 'Тж гтижк лжм тлжмк лЮк ЮгЬижгЮдхШк рк ШбтиШажк ШиаЯгцк.'
    qbf-lang[31] = 'О ШиаЯгцк зжм ШдлайлжаоЬх гЬ лЮд ЮгтиШ, Ю ЙмиаШбу ЬхдШа 1.'
    qbf-lang[32] = 'Ж жджгШйхШ лЮк ЮгтиШк лЮк ЬЩЫжгсЫШк.'.

ELSE

/*--------------------------------------------------------------------------*/

/* s-calc.p - mathematical expressions */
IF qbf-s = 8 THEN
  ASSIGN
    qbf-lang[ 1] = 'm,ПицйЯЬйЮ,n00=n25n26m...,~{1~} + ~{2~}'
    qbf-lang[ 2] = 'm,АнШхиЬйЮ,n00=n25n27m...,~{1~} - ~{2~}'
    qbf-lang[ 3] = 'm,ПжввШзвШйаШйгцк,n00=n28n29m...,~{1~} * ~{2~}'
    qbf-lang[ 4] = 'm,ГаШхиЬйЮ,n00=n30n31m...,~{1~} / ~{2~}'
    qbf-lang[ 5] = 'm,УпрйЬ йЬ ЫчдШгЮ,n00=n25n32m...,EXP(~{1~};~{2~})'

    qbf-lang[25] = 'ГщйлЬ лжд зищлж ШиаЯгц'
    qbf-lang[26] = 'ГщйлЬ лжд ЬзцгЬдж ШиаЯгц ЪаШ зицйЯЬйЮ'
    qbf-lang[27] = 'ГщйлЬ лжд ЬзцгЬдж ШиаЯгц ЪаШ ШнШхиЬйЮ'
    qbf-lang[28] = 'ГщйлЬ лжд зжввШзвШйаШйлтж'
    qbf-lang[29] = 'ГщйлЬ лжд зжввШзвШйаШйлу'
    qbf-lang[30] = 'ГщйлЬ лжд ЫаШаиЬлтж'
    qbf-lang[31] = 'ГщйлЬ лжд ЫаШаитлЮ'
    qbf-lang[32] = 'ГщйлЬ лЮ ЫчдШгЮ'.

/*--------------------------------------------------------------------------*/

RETURN.
