/*********************************************************************
* Copyright (C) 2000 by Progress Software Corporation ("PSC"),       *
* 14 Oak Park, Bedford, MA 01730, and other contributors as listed   *
* below.  All Rights Reserved.                                       *
*                                                                    *
* The Initial Developer of the Original Code is PSC.  The Original   *
* Code is Progress IDE code released to open source December 1, 2000.*
*                                                                    *
* The contents of this file are subject to the Possenet Public       *
* License Version 1.0 (the "License"); you may not use this file     *
* except in compliance with the License.  A copy of the License is   *
* available as of the date of this notice at                         *
* http://www.possenet.org/license.html                               *
*                                                                    *
* Software distributed under the License is distributed on an "AS IS"*
* basis, WITHOUT WARRANTY OF ANY KIND, either express or implied. You*
* should refer to the License for the specific language governing    *
* rights and limitations under the License.                          *
*                                                                    *
* Contributors:                                                      *
*                                                                    *
*********************************************************************/
/* t-s-eng.p - English language definitions for general system use */

{ prores/t-define.i }

DEFINE INPUT PARAMETER qbf-s AS INTEGER NO-UNDO.

IF qbf-s < 0 THEN RETURN.
qbf-lang = "".

/*--------------------------------------------------------------------------*/

/* l-edit.p,s-edit.p */
IF qbf-s = 1 THEN
  ASSIGN
    qbf-lang[ 1] = 'Insert'
    qbf-lang[ 2] = 'Επιβεβαίωση εξόδου χωρίς αποθήκευση'
    qbf-lang[ 3] = 'Δώστε την ονομασία του αρχείου για συγχώνευση'
    qbf-lang[ 4] = 'Δώστε τους χαρακτήρες για αναζήτηση'
    qbf-lang[ 5] = 'Επιλογή πεδίου για παρεμβολή'
    qbf-lang[ 6] = 'Πατήστε [' + KBLABEL("GO") + '] αποθήκευση, ['
		 + KBLABEL("GET") + '] προσθήκη πεδίου, ['
		 + KBLABEL("END-ERROR") + '] ανάκληση.'
    qbf-lang[ 7] = 'Δεν βρέθηκε κατά την αναζήτηση.'.

ELSE

/*--------------------------------------------------------------------------*/

/* s-ask.p,s-where.p */
IF qbf-s = 2 THEN
  ASSIGN
    qbf-lang[ 1] = 'Ισούται με'
    qbf-lang[ 2] = 'Δεν Ισούται με'
    qbf-lang[ 3] = 'Μικρότερο από'
    qbf-lang[ 4] = 'Μικρότερο ή ίσο'
    qbf-lang[ 5] = 'Μεγαλύτερο από'
    qbf-lang[ 6] = 'Μεγαλύτερο ή ίσο'
    qbf-lang[ 7] = 'Αρχίζει από'
    qbf-lang[ 8] = 'Περιέχει'    /* must match [r.4.23] */
    qbf-lang[ 9] = 'Αντιστοιχεί με'

    qbf-lang[10] = 'Επιλογή πεδίου'
    qbf-lang[11] = 'Πράξη'
    qbf-lang[12] = 'Επιλέξτε τιμή'
    qbf-lang[13] = 'Συγκρίσεις'

    qbf-lang[14] = 'Καθορισμός τιμής από τον χρήστη στην ώρα εκτέλεσης.'
    qbf-lang[15] = 'Δώστε την ερώτηση που θα εμφανιστεί στην ώρα εκτέλεσης :'

    qbf-lang[16] = 'Καθορισμός τιμής μορφής' /* data-type */
    qbf-lang[17] = ''

    qbf-lang[18] = 'Πατήστε [' + KBLABEL("END-ERROR") + '] για τέλος.'
    qbf-lang[19] = 'Πατήστε [' + KBLABEL("END-ERROR") + '] για ανάκληση.'
    qbf-lang[20] = 'Πατήστε [' + KBLABEL("GET") + '] για Αμεσο Ορισμό.'

    qbf-lang[21] = 'Επιλέξτε τη μορφή σύγκρισης για το πεδίο.'

    qbf-lang[22] = 'Δώστε τη τιμή, μορφής ~{1~} για σύγκριση με "~{2~}".'
    qbf-lang[23] = 'Δώστε τη τιμή μορφής ~{1~} για "~{2~}".'
    qbf-lang[24] = 'Πατήστε [' + KBLABEL("PUT")
		 + '] για καθορισμό από τον χρήστη στην ώρα εκτέλεσης.'
    qbf-lang[25] = 'Σύνταξη:Το  ~{1~} είναι ~{2~} κάποια τιμή, μορφής ~{3~}.'

    qbf-lang[27] = 'Ο Αμεσος Ορισμός δεν συνεργάζεται με τον καθοριμό τιμής '
		 + 'από τον χρήστη στην ώρα εκτέλεσης. Χρησιμοποιήστε μόνο το ένα.'
    qbf-lang[28] = 'Η τιμή πρέπει να είναι γνωστή !'
    qbf-lang[29] = 'Δώστε άλλες τιμές για' /* '?' append to string */
    qbf-lang[30] = 'Θέλετε να ορίσετε άλλα κριτήρια επιλογής; '
    qbf-lang[31] = 'Ο συνδιασμός με τα προηγούμενα κριτήρια να γίνει με'
    qbf-lang[32] = 'Αμεσο Ορισμό'.

ELSE

/*--------------------------------------------------------------------------*/
IF qbf-s = 3 THEN
  ASSIGN
/* s-info.p, s-format.p */
    qbf-lang[ 1] = 'Ταξινόμηση κατά'  /* s-info.p automatically right-justifies */
    qbf-lang[ 2] = 'και κατά'    /*   1..9 and adds colons for you. */
    qbf-lang[ 3] = 'Αρχείο'      /* but must fit in format x(24) */
    qbf-lang[ 4] = 'Ενωτική σχέση'
    qbf-lang[ 5] = 'Οπου'
    qbf-lang[ 6] = 'Πεδίο'
    qbf-lang[ 7] = 'Πράξη'
    qbf-lang[ 9] = 'Παράλειψη Επαναλ.τιμών; '

    qbf-lang[10] = 'ΑΠΟ,ΑΝΑ,ΑΠΟ'
    qbf-lang[11] = 'Δεν έχετε επιλέξει τα αρχεία !'
    qbf-lang[12] = 'Μορφές Πεδίων και Ονομασίες'
    qbf-lang[13] = 'Μορφές'
    qbf-lang[14] = 'Επιλογή Πεδίου' /* also used by s-calc.p below */
    /* 15..18 must be format x(16) (see notes on 1..7) */
    qbf-lang[15] = 'Ονομασία'
    qbf-lang[16] = 'Μορφή'
    qbf-lang[17] = 'Database'
    qbf-lang[18] = 'Τύπος'
    qbf-lang[19] = 'Προηγούμενος χρόνος εκτέλεσης,λεπτά:δευτερόλεπτα'
    qbf-lang[20] = 'Η τιμή πρέπει να είναι γνωστή (?)'

/*s-calc.p*/ /* there are many more for s-calc.p, see qbf-s = 5 thru 8 */
/*s-calc.p also uses #14 */
    qbf-lang[27] = 'Δημιουργία Πραξεων'
    qbf-lang[28] = 'Πράξη'
    qbf-lang[29] = 'Θελετε να προσθέτετε άλλα στοιχεία σ''αυτή τη πράξη; '
    qbf-lang[30] = 'Επιλογή Λειτουργίας'
    qbf-lang[31] = 'η σημερινή ημερομηνία'
    qbf-lang[32] = 'σταθερή τιμή'.

ELSE

/*--------------------------------------------------------------------------*/

IF qbf-s = 4 THEN
  ASSIGN
/*s-help.p*/
    qbf-lang[ 1] = 'Δεν υπάρχει βοήθεια γι''αυτή την επιλογή.'
    qbf-lang[ 2] = 'Βοήθεια'

/*s-order.p*/
    qbf-lang[15] = 'Αύξουσα/Φθίνουσα' /*neither can be over 8 characters */
    qbf-lang[16] = 'Για το καθένα δώστε "Α" για αύξουσα σειρά'
    qbf-lang[17] = 'ή "Φ" για φθίνουσα σειρά.'

/*s-define.p*/
    qbf-lang[21] = 'W. Πλάτος/Μορφή των Πεδίων'
    qbf-lang[22] = 'F. Πεδία'
    qbf-lang[23] = 'A. Ενεργά Αρχεία'
    qbf-lang[24] = 'T. Αθροίσματα και Υποσύνολα'
    qbf-lang[25] = 'R. Τρέχον Σύνολο'
    qbf-lang[26] = 'P. Ποσοστό του Συνόλου'
    qbf-lang[27] = 'C. Μετρητές'
    qbf-lang[28] = 'M. Μαθηματικές Πράξεις'
    qbf-lang[29] = 'S. Πράξεις με Αλφαριθμητικά'
    qbf-lang[30] = 'N. Πράξεις με Αριθμητικά'
    qbf-lang[31] = 'D. Πράξεις με Ημερομηνίες'
    qbf-lang[32] = 'L. Λογικές Πράξεις'.

ELSE

/*--------------------------------------------------------------------------*/

/* s-calc.p - string expressions */
IF qbf-s = 5 THEN
  ASSIGN
    qbf-lang[ 1] = 's,Σταθερό ή Πεδίο,s00=s24,~{1~}'
    qbf-lang[ 2] = 's,Substring,s00=s25n26n27,SUBSTRING(~{1~}'
		 + ';INTEGER(~{2~});INTEGER(~{3~}))'
    qbf-lang[ 3] = 's,Συνδιασμός δύο Αλφαριθμητικών,s00=s28s29,~{1~} + ~{2~}'
    qbf-lang[ 4] = 's,Συνδιασμός τριών Αλφαριθμητικών,s00=s28s29s29,'
		 + '~{1~} + ~{2~} + ~{3~}'
    qbf-lang[ 5] = 's,Συνδιασμός τεσσάρων Αλφαριθμητικών,s00=s28s29s29s29,'
		 + '~{1~} + ~{2~} + ~{3~} + ~{4~}'
    qbf-lang[ 6] = 's,Το μικρότερο δύο Αλφαριθμητικών,s00=s30s31,MINIMUM(~{1~};~{2~})'
    qbf-lang[ 7] = 's,Το μεγαλύτερο δύο Αλφαριθμητικών,s00=s30s31,MAXIMUM(~{1~};~{2~})'
    qbf-lang[ 8] = 's,Μήκος Αλφαριθμητικού,n00=s32,LENGTH(~{1~})'
    qbf-lang[ 9] = 's,Ονομα Χρήστη (User ID),s00=,USERID("RESULTSDB")'
    qbf-lang[10] = 's,Τρέχουσα ώρα,s00=,STRING(TIME;"HH:MM:SS")'

    qbf-lang[24] = 'Δώστε την ονομασία πεδίου που θα εμφανισθεί σε νέα στήλη '
		 + 'στην εκτύπωση ή επιλέξτε <<σταθερή τιμή>> για να παρεμβάλλετε '
		 + 'ένα αλφαριθμητικό με σταθερή τιμή.'
    qbf-lang[25] = 'Το SUBSTRING σας δίνει τη δυνατότητα να απομονώσετε ένα '
		 + 'τμήμα ενός αλφαριθμητικού για εμφάνιση. Επιλέξτε την '
		 + 'ονομασία πεδίου.'  
    qbf-lang[26] = 'Καθορίστε τον πρώτο χαρακτήρα του τμήματος του αλφαριθμητικού'
    qbf-lang[27] = 'Δώστε τον αριθμό χαρακτήρων που θέλετε να απομονώσετε'
    qbf-lang[28] = 'Επιλέξτε την πρώτη τιμή'
    qbf-lang[29] = 'Επιλέξτε την επόμενη τιμή'
    qbf-lang[30] = 'Επιλέξτε τον πρώτο στοιχείο για σύγκριση'
    qbf-lang[31] = 'Επιλέξτε το δεύτερο στοιχείο για σύγκριση'
    qbf-lang[32] = 'Ο αριθμός που δίνεται αντιστοιχεί στο μήκος του επιλεγμένου '
		 + 'αλφαριθμητικού.'.

ELSE

/*--------------------------------------------------------------------------*/

/* s-calc.p - numeric expressions */
IF qbf-s = 6 THEN
  ASSIGN
    qbf-lang[ 1] = 'n,Σταθερό ή Πεδίο,n00=n26,~{1~}'
    qbf-lang[ 2] = 'n,Το Μικρότερο δύο αριθμών,n00=n24n25,MINIMUM(~{1~};~{2~})'
    qbf-lang[ 3] = 'n,Το Μεγαλύτερο δύο αριθμών,n00=n24n25,MAXIMUM(~{1~};~{2~})'
    qbf-lang[ 4] = 'n,Υπόλοιπο Διαίρεσης (MOD),n00=n31n32,~{1~} MODULO ~{2~}'
    qbf-lang[ 5] = 'n,Απόλυτη Τιμή,n00=n27,'
		 + '(IF ~{1~} < 0 THEN - ~{1~} ELSE ~{1~})'
    qbf-lang[ 6] = 'n,Στρογγυλοποίηση,n00=n28,ROUND(~{1~};0)'
    qbf-lang[ 7] = 'n,Περικοπή,n00=n29,TRUNCATE(~{1~};0)'
    qbf-lang[ 8] = 'n,Τετραγωνική Ρίζα,n00=n30,SQRT(~{1~})'
    qbf-lang[ 9] = 'n,Εμφάνιση της ώρας,s00=n23,STRING(INTEGER(~{1~});"HH:MM:SS")'

    qbf-lang[23] = 'Επιλέξτε το πέδιο για εμφάνιση ως HH:MM:SS'
    qbf-lang[24] = 'Επιλέξτε το πρώτο στοιχείο για σύγκριση'
    qbf-lang[25] = 'Επιλεξτε το δεύτερο στοιχείο για σύγκριση'
    qbf-lang[26] = 'Δώστε την ονομασία πεδίου που θα εμφανισθεί σε νέα στήλη '
		 + 'στην εκτύπωση ή επιλέξτε <<σταθερή τιμή>> για να παρεμβάλετε '
		 + 'μία σταθερή αριθμητική τιμή.'
    qbf-lang[27] = 'Επιλέξτε ενα πεδίο που θα εμφανισθεί ως απόλυτη τιμή '
		 + '(χωρίς πρόσημο).'
    qbf-lang[28] = 'Επιλέξτε ένα πεδίο που θα στρόγγυλοποιηθεί στο πλησιέστερο ακέραιο.'
    qbf-lang[29] = 'Επιλέξτε ένα πεδίο για περικοπή (αφαίρεση του δεκαδικού μέρος).'
    qbf-lang[30] = 'Επιλέξτε ένα πεδίο για υπολογισμό της τετραγωνικής ρίζας.'
    qbf-lang[31] = 'Το υπόλοιπο της πράξης : διαιρετέος / διαιρέτης = πηλίκο '
		 + '+ υπόλοιπο.  Δώστε τον διαιρετέο'
    qbf-lang[32] = 'Δώστε τον διαιρέτη'.

ELSE

/*--------------------------------------------------------------------------*/

/* s-calc.p - date expressions */
IF qbf-s = 7 THEN
  ASSIGN
    qbf-lang[ 1] = 'd,Σημερινή Ημερομηνία,d00=,TODAY'
    qbf-lang[ 2] = 'd,Προσθήκη Ημερών σε Ημερομηνία,d00=d22n23,~{1~} + ~{2~}'
    qbf-lang[ 3] = 'd,Αφαίρεση Ημερών από Ημερομηνία,d00=d22n24,~{1~} - ~{2~}'
    qbf-lang[ 4] = 'd,Διαφορά μεταξύ δύο Ημερομηνιών,n00=d25d26,~{1~} - ~{2~}'
    qbf-lang[ 5] = 'd,Η Προγενέστερη δυο Ημερομηνιών,d00=d20d21,MINIMUM(~{1~};~{2~})'
    qbf-lang[ 6] = 'd,Η Μεταγενέστερη δύο Ημερομηνιών,d00=d20d21,MAXIMUM(~{1~};~{2~})'
    qbf-lang[ 7] = 'd,Η ημέρα ως αριθμός,n00=d27,DAY(~{1~})'
    qbf-lang[ 8] = 'd,Το Μήνα ως αριθμός,n00=d28,MONTH(~{1~})'
    qbf-lang[ 9] = 'd,Η Ονομασία του Μήνα,s00=d29,ENTRY(MONTH(~{1~});"Ιανουάριος'
		 + ';Φεβρουάριος;Μάρτιος;Απρίλιος;Μαϊος;Ιούνιος;Ιούλιος;Αύγουστος;Σεπτέμβριος'
		 + ';Οκτώβριος;Νοέμβριος;Δεκέμβριος")'
    qbf-lang[10] = 'd,Το Ετος ως Αριθμός,n00=d30,YEAR(~{1~})'
    qbf-lang[11] = 'd,Η Ημέρα της Εβδομάδας,n00=d31,WEEKDAY(~{1~})'
    qbf-lang[12] = 'd,Η Ονομασία της Ημέρας,s00=d32,ENTRY(WEEKDAY(~{1~});"'
		 + 'Κυριακή;Δευτέρα;Τρίτη;Τετάρτη;Πέμπτη;Παρασκευή;Σάββατο")'

    qbf-lang[20] = 'Επιλέξτε το πρώτο στοιχείο για σύγκριση'
    qbf-lang[21] = 'Επιλέξτε το δεύτερο στοιχείο για σύγκριση'
    qbf-lang[22] = 'Επιλέξτε το πεδίο ημερομηνίας.'
    qbf-lang[23] = 'Επιλέξτε το πεδίο που περιέχει τον αριθμό ημερών που '
		 + 'θα προστεθεί στην ημερομηνία.'
    qbf-lang[24] = 'Επιλέξτε το πεδίο που περιέχει τον αριθμό ημερών που '
		 + 'θα αφαιρεθεί από την ημαρομηνία.'
    qbf-lang[25] = 'Σύγκριση δύο ημερομηνιών και η εμφάνιση στήλης που περιέχει '
		 + 'τη διαφορά μεταξύ τους, σε ημέρες.  Επιλέξτε το '
		 + 'πρώτο πεδίο.'
    qbf-lang[26] = 'Επιλέξτε το δεύτερο πεδίο ημερομηνίας.'
    qbf-lang[27] = 'Η ημέρα του μήνα ως αριθμός από '
		 + '1 έως 31.'
    qbf-lang[28] = 'Το μήνα του έτους ως αριθμός από '
		 + '1 έως 12.'
    qbf-lang[29] = 'Η ονομασία του μήνα.'
    qbf-lang[30] = 'Το μέρος του έτους της ημερομηνίας ως ακέραιος αριθμός.'
    qbf-lang[31] = 'Ο αριθμός που αντιστοιχεί με την ημέρα, η Κυριακή είναι 1.'
    qbf-lang[32] = 'Η ονομασία της ημέρας της εβδομάδας.'.

ELSE

/*--------------------------------------------------------------------------*/

/* s-calc.p - mathematical expressions */
IF qbf-s = 8 THEN
  ASSIGN
    qbf-lang[ 1] = 'm,Πρόσθεση,n00=n25n26m...,~{1~} + ~{2~}'
    qbf-lang[ 2] = 'm,Αφαίρεση,n00=n25n27m...,~{1~} - ~{2~}'
    qbf-lang[ 3] = 'm,Πολλαπλασιασμός,n00=n28n29m...,~{1~} * ~{2~}'
    qbf-lang[ 4] = 'm,Διαίρεση,n00=n30n31m...,~{1~} / ~{2~}'
    qbf-lang[ 5] = 'm,Υψωσε σε δύναμη,n00=n25n32m...,EXP(~{1~};~{2~})'

    qbf-lang[25] = 'Δώστε τον πρώτο αριθμό'
    qbf-lang[26] = 'Δώστε τον επόμενο αριθμό για πρόσθεση'
    qbf-lang[27] = 'Δώστε τον επόμενο αριθμό για αφαίρεση'
    qbf-lang[28] = 'Δώστε τον πολλαπλασιαστέο'
    qbf-lang[29] = 'Δώστε τον πολλαπλασιαστή'
    qbf-lang[30] = 'Δώστε τον διαιρετέο'
    qbf-lang[31] = 'Δώστε τον διαιρέτη'
    qbf-lang[32] = 'Δώστε τη δύναμη'.

/*--------------------------------------------------------------------------*/

RETURN.
